{"id":21018,"date":"2022-10-24T01:08:00","date_gmt":"2022-10-24T00:08:00","guid":{"rendered":"https:\/\/luxtradingfirm.com\/?p=21018"},"modified":"2022-12-14T00:07:53","modified_gmt":"2022-12-14T00:07:53","slug":"how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges","status":"publish","type":"post","link":"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/","title":{"rendered":"How to Create a Bulletproof Trading Plan to Pass Prop Firm Challenges"},"content":{"rendered":"<p><span>Forex trading is not easy, that’s a given. However, it can become a much easier feat if you are working solely from a pre-set trading plan. By removing human decisions and emotions, you’re much more likely to succeed in the forex market. <\/span><span>However, creating a trading plan is something that most retail traders do wrong and this leads to continuous losses and very large drawdowns &#8211; something we are obviously looking to avoid in a prop firm-funded account! <\/span><span> <\/span><\/p>\n<p><span>In this article, we are going to walk through exactly what you need to do when creating a bulletproof trading plan, specifically aimed at prop firm traders. This will cover the 9 crucial elements of a trading plan that should gear you for success! <\/span><\/p>\n<p><span>Let’s get into it… <\/span><\/p>\n<h2><strong>Creating A Prop Firm-Friendly Trading Plan (In 9 Steps)<\/strong><\/h2>\n<p><span>When creating a trading plan, it’s important to take your time. It can take professional traders weeks or even months to create something worth sticking to. If you only spend a few hours creating a strategy and a trading plan, it’s most likely going to fail! <\/span><span>The idea behind the trading plan is that you, as the trader, have a rigid process to follow. This means that the quality of trades is consistent and you follow an SOP (Standard Operating Procedure). This increases the likelihood of success over the long term. <\/span><\/p>\n<p><span>With that being said, let’s look at the 9 most important aspects to consider when building your forex trading plan… <\/span><\/p>\n<ol>\n<li><strong>Entry Criteria<\/strong><\/li>\n<\/ol>\n<p><strong> <\/strong><span>The entry criteria are typically the only aspect of a trading plan that most traders think about. It’s certainly very important if not one of the most important parts of a successful trading plan. <\/span><span>In short, why would you enter a trade? When would you enter a trade? <\/span><span>This can be decided upon by any number of reasons from indicator signals, to price action, to supply and demand or perceived volume within the markets. <\/span><span>The entry criteria are normally described as a ‘trading strategy’. When building your entry criteria, you need to be as objective as possible. This means that you could give your trading plan to someone very inexperienced and they would get the same outcome in a trade as you would, as an experienced trader. <\/span><span>It’s of great importance to limit the ‘human bias’ and ensure that there is a defined rule to enter a trade. <\/span><span>An example of this would be &#8211; ‘Once the 50 EMA crosses the 200 EMA, if the price is currently below the 100 EMA, a sell position would be activated’.<\/span><strong> <\/strong><\/p>\n<ol start=\"2\">\n<li><strong> <\/strong><strong>Stop Loss<\/strong><\/li>\n<\/ol>\n<p><span><a href=\"https:\/\/www.babypips.com\/learn\/forex\/stop-loss-whats-that\">Stop loss<\/a> management is another critical part of a trading plan. Knowing exactly where to place the stop loss in every trade, before you enter the trade. <\/span><span>This can be decided by a number of different factors. For example, having a fixed number of pips that will be your default stop loss, or using a recent swing low or swing high. <\/span><span>Again, much like with the entry criteria, you should be able to give your trading plan to a newbie trader and they should have no doubts about where the stop loss should be placed. <\/span><span>If it’s not objective and you’re eyeballing this, you need to spend longer developing the stop-loss strategy. <\/span><\/p>\n<ol start=\"3\">\n<li><strong> <\/strong><strong>Time Frames<\/strong><\/li>\n<\/ol>\n<p><span>As a trader, you should always know which time frames you’re using in the markets and which are being used for what purpose. <\/span><span>For instance, many traders will use the 1H and 4H time frames for entries, but use the D1 and W1 time frames to decide their trading bias bullishly or bearish. <\/span><span> <\/span><span>There should be no subjectivity to this. You cannot be using the Monthly time frame for analysis and then choosing to enter said trade on the 5-minute time frame &#8211; this will not be the best time frame for your longer-term bias. <\/span><span>There are going to be anomalies to this rule but as a general rule, the time frames being used must be fit for the purpose. <\/span><strong> <\/strong><\/p>\n<ol start=\"4\">\n<li><strong> <\/strong><strong>Risk Management Criteria<\/strong><\/li>\n<\/ol>\n<p><span>Risk management, especially as a <a href=\"https:\/\/luxtradingfirm.com\/lux-elite-traders-club\/\">prop firm-funded trader<\/a> is the most important tool in your trader&#8217;s toolbox. With most online prop firms having a strict loss limit, you need to ensure that you never get close to the limit and certainly never exceed it. <\/span><span>When building your risk management strategy, first you need to look at your risk of ruin or risk of burning the funded account. <\/span><span>This can easily be known from backtesting and understanding how many losses have come in a row, over hundreds of trades. Let’s assume the maximum concurrent losses over a large data set came in at 15. <\/span><span>Knowing you could potentially lose 15 trades in a row, with a 10% maximum drawdown limit, you need to be using, at a push, 0.5% risk per trade. To stay safe, I would recommend potentially even using 0.25% risk per trade. <\/span><span>Once establishing the value risked per trade, we need to look at when you will manage this risk. <\/span><span>Can you move trades to breakeven at a certain point? If so, when? What triggers a trade to be worth covering? <\/span><span>You then need to test this and see if it costs you money because you’re stopped out at breakeven on potentially winning trades. Is this a worthy payoff? <\/span><span>This should all be clearly defined in a trading plan so I could follow your risk management strategy, as a beginner. <\/span><span>Here is an article about <a href=\"https:\/\/luxtradingfirm.com\/2022\/10\/10\/how-to-manage-drawdown-when-doing-a-prop-firm-challenge\/\">managing risk when doing a prop firm challenge<\/a>.<\/span><strong> <\/strong><\/p>\n<ol start=\"5\">\n<li><strong> <\/strong><strong>Frequency <\/strong><\/li>\n<\/ol>\n<p><span>Trading frequency plays a huge role in being successful as a funded trader. It’s all well and good having an 85% win rate on trades but if that only comes into fruition once per year, you will struggle to make money in the markets. <\/span><span>For this reason, it’s important to assess the frequency of your trading strategy and entry criteria. <\/span><span>You want to be in enough positions to consistently be trading each month\/quarter, but also not be in 1000 trades at once. You need to dial in what the perfect frequency looks like for your trading strategy. <\/span><span>If you’re trading too frequently, look at potentially stepping up in time frames. If you’re trading too little, look at utilizing the lower time frames or adding to positions with further entries. Define rules and processes around this.<\/span><strong> <\/strong><\/p>\n<ol start=\"6\">\n<li><strong> <\/strong><strong>Risk To Reward Ratios <\/strong><\/li>\n<\/ol>\n<p><span>Although it would be lovely to have a win rate of 100% within the markets, it’s highly unrealistic for manual traders. If you are trading manually, something along the lines of a 50%-60% win rate is much more achievable. <\/span><span>With that being the case, you will need to win much larger than you lose. This is known as <a href=\"https:\/\/www.thebalancemoney.com\/risk-to-reward-ratio-1031350\">risk to reward<\/a>. <\/span><span>This can easily be calculated before entering a trade and you should have defined rules around this. For instance, having a rule in place where you cannot take a trade if it’s less than 1:1 RR. <\/span><span>This rule would then discourage you from taking trades that, over the long term, would result in a lack of return for you in the markets. <\/span><span>Likewise, it’s important to not aim for a ridiculously large RR. Once you’re in a trade, the majority of currencies aren’t going to suddenly move 10,000 pips for you. <\/span><span>Be realistic and understand what your strategy achieves on average, then build a solid base around this data. <\/span><span>Understanding your average risk-to-reward ratios makes it much easier to <a href=\"https:\/\/luxtradingfirm.com\/2022\/07\/24\/how-to-get-funding-as-a-forex-trader\/\">get funding as a forex trader<\/a>.<\/span><\/p>\n<ol start=\"7\">\n<li><strong> <\/strong><strong>Multiple Entry Criteria<\/strong><\/li>\n<\/ol>\n<p><span>Adding to winning trades is a great way to increase your profits from trading, without taking on any additional risk. If done well, this is brilliant, however, it’s not simple. <\/span><span>When do you add more trades? What entry criteria are you using? At what point in a trade, is another entry worth taking? Do you do this on all positions or only positions going with the larger trend? <\/span><span>There is so much to think about but ultimately, if you can create a rule around this, this can massively increase your results within the markets. <\/span><span>For more information on multiple entries, have a read of our ‘<a href=\"https:\/\/luxtradingfirm.com\/2022\/10\/03\/8-tips-for-growing-your-small-forex-trading-account\/\">8 tips for growing your small trading account<\/a>’ article, where we break this theory down in more detail. <\/span><strong> <\/strong><\/p>\n<ol start=\"8\">\n<li><strong> <\/strong><strong>Backtesting <\/strong><\/li>\n<\/ol>\n<p><span>For the majority of traders, <a href=\"https:\/\/forexbrokerreport.com\/how-to-backtest-a-forex-trading-strategy-full-guide\/\">backtesting<\/a> is the best way to actually see if your trading plan makes sense. <\/span><span>I’ve worked with hundreds of traders over the years that have built what seems to be an incredibly solid plan, only to still lose money in the markets. <\/span><span>The reality is that only so many things have an edge in the markets. The forex markets are zero-sum, meaning it’s hard to find an edge. <\/span><span>The only way to know if you’ve actually found an edge is to build a strategy and test it hundreds of times. If you’re trading manually, this could take years to do. <\/span><span>However, there are a great number of backtesting tools out there to try. I’d highly recommend investing in a tool to assist in your backtesting. <\/span><span>This isn’t without flaws though. <\/span><span>When performing a backtest, most traders use human bias and find great results, only to find terrible results in the live markets. This can easily be fixed by using a rigid, robust trading plan that is immune to human emotion and bias. <\/span><span>I cannot stress this enough &#8211; do not trade live until you have at least 200 trades with this exact strategy under your belt. You’re just wasting your own time and money if you try to cut corners! Not backtesting is the number one reason <a href=\"https:\/\/luxtradingfirm.com\/2022\/06\/19\/why-do-most-forex-traders-fail-in-the-markets\/\">why forex traders fail<\/a>.<\/span><strong> <\/strong><\/p>\n<ol start=\"9\">\n<li><strong> <\/strong><strong>Strategy Bucket<\/strong><\/li>\n<\/ol>\n<p><span>If you ask any long-time professional trader, they will have multiple trading strategies in their arsenal. You never know when a strategy is going to stop working or going to suffer a few months of drawdown. <\/span><span>By having 2-5 strategies in your bucket, you are going to weather the drawdown and potentially find much better results in a market as liquid as the forex market. <\/span><span>I’d recommend using strategies that do not have correlations. This means that if one strategy is struggling to generate any kind of meaningful return, your other trading strategies should not follow this trend. <\/span><span>By concurrently trading 2-5 uncorrelated strategies, you are giving yourself the best possible chance at never hitting your maximum drawdown! <\/span><\/p>\n<h2><strong>In Summary &#8211; How To Create A Trading Plan For Funded Trading Accounts<\/strong><\/h2>\n<p><span>In conclusion, building an objective and realistic trading plan is very much needed for long-term success in the foreign exchange markets. <\/span><span> <\/span><span>When becoming a <a href=\"https:\/\/luxtradingfirm.com\/lux-elite-traders-club\/\">prop firm funded trader<\/a>, there are a lot of hoops to jump through that keep you truly accountable for your actions. <\/span><span>By building a trading plan, you can ensure you always trade to the best of your ability and don’t let those pesky emotions get in the way! <\/span><\/p>\n<p><span>If you need any help in creating a trading plan, please feel free to contact our team! <\/span><\/p>\n<p><span> <\/span><span>Are you looking to <a href=\"https:\/\/luxtradingfirm.com\/#freetrial\">get funded<\/a>? <a href=\"https:\/\/luxtradingfirm.com\">Contact us now<\/a>! <\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Forex trading is not easy, that’s a given. However, it can become a much easier feat if you are working solely from a pre-set trading plan. By removing human decisions and emotions, you’re much more likely to succeed in the forex market. However, creating a trading plan is something that most retail traders do wrong and&#8230;<\/p>\n","protected":false},"author":198174106,"featured_media":23868,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_coblocks_attr":"","_coblocks_dimensions":"","_coblocks_responsive_height":"","_coblocks_accordion_ie_support":"","_mo_disable_npp":"","jetpack_anchor_podcast":"","jetpack_anchor_episode":"","jetpack_anchor_spotify_show":""},"categories":[1447],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v20.5 (Yoast SEO v20.5) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Create a Bulletproof Trading Plan to Pass Prop Firm Challenges - Lux Trading Firm<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Create a Bulletproof Trading Plan to Pass Prop Firm Challenges\" \/>\n<meta property=\"og:description\" content=\"Forex trading is not easy, that’s a given. However, it can become a much easier feat if you are working solely from a pre-set trading plan. By removing\" \/>\n<meta property=\"og:url\" content=\"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/\" \/>\n<meta property=\"og:site_name\" content=\"Lux Trading Firm\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/\" \/>\n<meta property=\"article:published_time\" content=\"2022-10-24T00:08:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-12-14T00:07:53+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/luxtradingfirm.com\/wp-content\/uploads\/2022\/12\/How-To-Create-A-Bulletproof-Trading-Plan-For-Passing-Prop-Firm-Challenges.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"800\" \/>\n\t<meta property=\"og:image:height\" content=\"533\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Lux Trading Firm LTD\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@FirmLux\" \/>\n<meta name=\"twitter:site\" content=\"@FirmLux\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Lux Trading Firm LTD\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/\"},\"author\":{\"name\":\"Lux Trading Firm LTD\",\"@id\":\"https:\/\/luxtradingfirm.com\/#\/schema\/person\/5a4c46c34af9ab91027318b3018599b1\"},\"headline\":\"How to Create a Bulletproof Trading Plan to Pass Prop Firm Challenges\",\"datePublished\":\"2022-10-24T00:08:00+00:00\",\"dateModified\":\"2022-12-14T00:07:53+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/\"},\"wordCount\":1847,\"publisher\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#organization\"},\"articleSection\":[\"Funded Trading\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/\",\"url\":\"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/\",\"name\":\"How to Create a Bulletproof Trading Plan to Pass Prop Firm Challenges - Lux Trading Firm\",\"isPartOf\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#website\"},\"datePublished\":\"2022-10-24T00:08:00+00:00\",\"dateModified\":\"2022-12-14T00:07:53+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/luxtradingfirm.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How to Create a Bulletproof Trading Plan to Pass Prop Firm Challenges\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/luxtradingfirm.com\/#website\",\"url\":\"https:\/\/luxtradingfirm.com\/\",\"name\":\"Lux Trading Firm\",\"description\":\"Funded Forex Trading Program\",\"publisher\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/luxtradingfirm.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/luxtradingfirm.com\/#organization\",\"name\":\"Lux Trading Firm\",\"url\":\"https:\/\/luxtradingfirm.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1\",\"width\":3400,\"height\":1104,\"caption\":\"Lux Trading Firm\"},\"image\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/\",\"https:\/\/twitter.com\/FirmLux\",\"https:\/\/www.instagram.com\/luxtradingfirm\/\",\"https:\/\/www.youtube.com\/channel\/UCZydph7k_5BXAgHIedXPoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/luxtradingfirm.com\/#\/schema\/person\/5a4c46c34af9ab91027318b3018599b1\",\"name\":\"Lux Trading Firm LTD\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/luxtradingfirm.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8e0fe2fd9be1cc229883e6addd7ca6a2?s=96&d=identicon&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8e0fe2fd9be1cc229883e6addd7ca6a2?s=96&d=identicon&r=g\",\"caption\":\"Lux Trading Firm LTD\"},\"sameAs\":[\"http:\/\/luxtradingfirm.wordpress.com\"],\"url\":\"https:\/\/luxtradingfirm.com\/author\/luxtradingfirm\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"How to Create a Bulletproof Trading Plan to Pass Prop Firm Challenges - Lux Trading Firm","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/","og_locale":"en_US","og_type":"article","og_title":"How to Create a Bulletproof Trading Plan to Pass Prop Firm Challenges","og_description":"Forex trading is not easy, that’s a given. However, it can become a much easier feat if you are working solely from a pre-set trading plan. By removing","og_url":"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/","og_site_name":"Lux Trading Firm","article_publisher":"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/","article_published_time":"2022-10-24T00:08:00+00:00","article_modified_time":"2022-12-14T00:07:53+00:00","og_image":[{"width":800,"height":533,"url":"https:\/\/luxtradingfirm.com\/wp-content\/uploads\/2022\/12\/How-To-Create-A-Bulletproof-Trading-Plan-For-Passing-Prop-Firm-Challenges.jpg","type":"image\/jpeg"}],"author":"Lux Trading Firm LTD","twitter_card":"summary_large_image","twitter_creator":"@FirmLux","twitter_site":"@FirmLux","twitter_misc":{"Written by":"Lux Trading Firm LTD","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/#article","isPartOf":{"@id":"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/"},"author":{"name":"Lux Trading Firm LTD","@id":"https:\/\/luxtradingfirm.com\/#\/schema\/person\/5a4c46c34af9ab91027318b3018599b1"},"headline":"How to Create a Bulletproof Trading Plan to Pass Prop Firm Challenges","datePublished":"2022-10-24T00:08:00+00:00","dateModified":"2022-12-14T00:07:53+00:00","mainEntityOfPage":{"@id":"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/"},"wordCount":1847,"publisher":{"@id":"https:\/\/luxtradingfirm.com\/#organization"},"articleSection":["Funded Trading"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/","url":"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/","name":"How to Create a Bulletproof Trading Plan to Pass Prop Firm Challenges - Lux Trading Firm","isPartOf":{"@id":"https:\/\/luxtradingfirm.com\/#website"},"datePublished":"2022-10-24T00:08:00+00:00","dateModified":"2022-12-14T00:07:53+00:00","breadcrumb":{"@id":"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/luxtradingfirm.com\/2022\/10\/24\/how-to-create-a-bulletproof-trading-plan-to-pass-prop-firm-challenges\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/luxtradingfirm.com\/"},{"@type":"ListItem","position":2,"name":"How to Create a Bulletproof Trading Plan to Pass Prop Firm Challenges"}]},{"@type":"WebSite","@id":"https:\/\/luxtradingfirm.com\/#website","url":"https:\/\/luxtradingfirm.com\/","name":"Lux Trading Firm","description":"Funded Forex Trading Program","publisher":{"@id":"https:\/\/luxtradingfirm.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/luxtradingfirm.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/luxtradingfirm.com\/#organization","name":"Lux Trading Firm","url":"https:\/\/luxtradingfirm.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/","url":"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1","contentUrl":"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1","width":3400,"height":1104,"caption":"Lux Trading Firm"},"image":{"@id":"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/","https:\/\/twitter.com\/FirmLux","https:\/\/www.instagram.com\/luxtradingfirm\/","https:\/\/www.youtube.com\/channel\/UCZydph7k_5BXAgHIedXPoKg"]},{"@type":"Person","@id":"https:\/\/luxtradingfirm.com\/#\/schema\/person\/5a4c46c34af9ab91027318b3018599b1","name":"Lux Trading Firm LTD","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/luxtradingfirm.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/8e0fe2fd9be1cc229883e6addd7ca6a2?s=96&d=identicon&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8e0fe2fd9be1cc229883e6addd7ca6a2?s=96&d=identicon&r=g","caption":"Lux Trading Firm LTD"},"sameAs":["http:\/\/luxtradingfirm.wordpress.com"],"url":"https:\/\/luxtradingfirm.com\/author\/luxtradingfirm\/"}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2022\/12\/How-To-Create-A-Bulletproof-Trading-Plan-For-Passing-Prop-Firm-Challenges.jpg?fit=800%2C533&ssl=1","jetpack_shortlink":"https:\/\/wp.me\/pcDwIy-5t0","amp_enabled":true,"_links":{"self":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/posts\/21018"}],"collection":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/users\/198174106"}],"replies":[{"embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/comments?post=21018"}],"version-history":[{"count":3,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/posts\/21018\/revisions"}],"predecessor-version":[{"id":21023,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/posts\/21018\/revisions\/21023"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/media\/23868"}],"wp:attachment":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/media?parent=21018"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/categories?post=21018"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/tags?post=21018"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}