{"id":1774,"date":"2020-12-16T11:27:47","date_gmt":"2020-12-16T11:27:47","guid":{"rendered":"http:\/\/microwebtechnology.com\/luxtradingfirm\/?page_id=1774"},"modified":"2023-04-03T11:00:39","modified_gmt":"2023-04-03T10:00:39","slug":"terms-of-use","status":"publish","type":"page","link":"https:\/\/luxtradingfirm.com\/terms-of-use\/","title":{"rendered":"Terms of use"},"content":{"rendered":"<p>[vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; crypterium_vc_row_jarallax=&#8221;yes&#8221; el_id=&#8221;intro&#8221; p_img=&#8221;2015&#8243; crypterium_vc_row_jarallax_speed=&#8221;0.3&#8243;][vc_column]<div class=\"section-heading   col-MB- section-heading--center \" ><h1 class=\"__title\">Terms of use<\/h1><\/div>[\/vc_column][\/vc_row][vc_row full_width=&#8221;stretch_row&#8221; crypterium_vc_row_overflow=&#8221;hidden&#8221; css=&#8221;.vc_custom_1608118807347{padding-top: 100px !important;padding-bottom: 50px !important;}&#8221;][vc_column]<div class=\"section-heading   col-MB-35 text--left \" ><h2 class=\"__title\">Last Modified: September 21, 2022<\/h2><\/div>[vc_row_inner][vc_column_inner][vc_column_text css=&#8221;.vc_custom_1680516036161{margin-bottom: 60px !important;}&#8221;]These Terms of Use govern access to and the use of the Sites or Services of<span> <\/span><a>Lux Trading Firm<\/a>, a UK private company, by our account holders, users, and visitors (“you”, “your”, or “User”), however such Sites or Services are accessed, including any content, functionality, products and services, information about our products and services, your accounts, and other tools offered. All capitalized terms not otherwise defined herein shall have the meanings set forth in the Privacy Policy which is incorporated herein by reference.<\/p>\n<p><strong>The Lux Trading Firm Sites and Services are offered to you subject to your affirmative and unequivocal acceptance, without modification, of all the Terms in their entirety. When accepted by you, these Terms form a legally binding contract between you and Lux Trading Firm. If you are entering into these Terms on behalf of an entity, you represent that you have the legal authority to bind that entity.<\/strong><\/p>\n<p>PPLEASE READ THESE TERMS CAREFULLY. BY REGISTERING FOR, ACCESSING, BROWSING, CREATING AN ACCOUNT, POSTING OR DOWNLOADING CONTENT, AND\/OR OTHERWISE USING THE<span> <\/span><strong>Lux Trading Firm<\/strong><span> <\/span>SITES OR SERVICES, YOU ACKNOWLEDGE THAT YOU HAVE READ, UNDERSTOOD, AND AGREE TO BE BOUND BY THESE TERMS. IF YOU DO NOT AGREE TO BE BOUND BY THESE TERMS, DO NOT ACCESS, BROWSE OR OTHERWISE USE THE<span> <\/span><strong>Lux Trading Firm<\/strong><span> <\/span>SERVICES.<\/p>\n<p>Once accepted, these Terms remain effective until terminated as provided for herein. We reserve the right to modify or change these Terms after providing notice to you. The form of such notice is at our discretion. For more information, please see Section 26 below. We may, in our sole discretion, elect to suspend or terminate access to, or use of, the Lux Trading Firm Services by anyone who violates these Terms.<\/p>\n<p>The official language used by Lux Trading Firm is English; in the event of a conflict between the English language version of this document and any version translated into any other language, the English language version shall prevail.<\/p>\n<h4><strong>1. Definitions<\/strong><\/h4>\n<p>“Account” means an account of a User that is registered with Lux Trading Firm that has access to specified Services or functionality of Sites of Lux Trading Firm.<\/p>\n<p>“Co-brand” means your display of any of the Intellectual Property, or your taking of other means of attribution or identification of Lux Trading Firm, in such a manner reasonably likely to give a third party the impression that you or the third party has the right to display, publish or distribute our Sites or Services or any Content.<\/p>\n<p>“Content” means all information and other materials present on the Sites, including Lux Trading Firm products and services, text, images, photos, trading ideas, publications, opinions, rumors, advice, charts, financial information, ratings, and reviews.<\/p>\n<p>“Credit Card Information” means certain credit card information, including your card number, CVV number, expiration date, phone number, name, billing address, and email address.<\/p>\n<p>“Data” means information generated by you and other Users (whether aggregated or otherwise)<\/p>\n<p>“Data Protection Officer” means the person or entity in charge of the data processing operation.<\/p>\n<p>“Debit Card Information” means certain debit card information, including your card number, CVV number, expiration date, phone number, name, billing address, and email address.<\/p>\n<p>“Designated Agent” means the Lux Trading Firm representative designated to receive notification of claimed infringement under the Digital Millennium Copyright Act.<\/p>\n<p>“Fee” means regular payment for using the activated Account.<\/p>\n<p>“Feedback” means your comments, feedback, information, or other materials regarding the Sites and Services.<\/p>\n<p>“Force Majeure Event” means any act or event beyond our reasonable control, including strikes, lock-outs, or other industrial action by third parties, civil commotion, pandemic, riot, government orders, invasion, terrorist attack or threat of terrorist attack, war (whether declared or not) or threat or preparation for war, fire, explosion, storm, flood, earthquake, subsidence, epidemic, or other natural disaster, or failure of public or private telecommunications networks or impossibility of the use of railways, shipping, aircraft, motor transport, or other means of public or private transport.<\/p>\n<p>“Intellectual Property” means Lux Trading Firm Sites and Services, their contents, or any copyright, trademark, trade name, service mark or any other proprietary information of Lux Trading Firm.<\/p>\n<p>“Linked Web Site” means any website owned by a third party to which or from which Lux Trading Firm Site is linked.<\/p>\n<p>“Marks” means, collectively, the trademarks, service marks, slogans, logos, trade dress, and other identifiers displayed on Lux Trading Firm Sites and Services.<\/p>\n<p>“Orders” means requests for subscriptions or other services which are placed through the Sites or Services or through a third-party affiliate.<\/p>\n<p>“Personal Data” means any information relating to an identified or identifiable natural person or any information that is used for the behavior profiling of a particular natural person, if that person is identified.<\/p>\n<p>“Restricted Business” means owning, operating, or developing a website that serves as a platform pursuant to which persons or entities engage in simulated futures trading.<\/p>\n<p>“Services” means, as applicable, the Funded Forex Trading Program or other services offered by an applicable affiliate of Lux Trading Firm.<\/p>\n<p>“Simulated Account” means an account using real-time simulated data. Trades in a simulated account are not made in live markets and do not incur actual profits or losses.<\/p>\n<p>“Sites” means Lux Trading Firm Websites, software, applications, online services, and products<\/p>\n<p>“System” means the integrated cloud computing solution for providing the Lux Trading Firm Services, including applications, software, hardware, data bases, interfaces, associated media, documentation, updates, new releases and other components or materials provided therewith<\/p>\n<p>“Terms” means the terms and conditions contained in these Terms of Use and all other operating rules, policies (including, our Privacy Policy) and any future modifications thereof, and procedures that may be published from time to time on the Sites or Services or made available to you on or through the Lux Trading Firm Services.<\/p>\n<p>“Third Party Services” means products or services that are not under the control of or maintained by Lux Trading Firm.<\/p>\n<p>“User” means a natural person who is 18 years of age or older who uses any of the Lux Trading Firm Sites and Services and, if applicable, is authorized to use the Lux Trading Firm Account on behalf of himself\/herself.<\/p>\n<p>“User Content” means blogs, comments, or other content submitted or posted by a User that is intended for public display on any of Lux Trading Firm Sites or Services.<\/p>\n<p>“User Credentials” means the unique email\/username and password combination.<\/p>\n<p>“Website” means the compilation of all web documents (including images, php and html files) made available via the domains <a href=\"http:\/\/www.lux-trading-firm.com\/\">www.lux-trading-firm.com<\/a><span> <\/span>or sub domains or domains with identical names under other top domains and owned by Lux Trading Firm.<\/p>\n<p><strong>2. Contact Information\/Designated Agent<\/strong><\/p>\n<p>If you have any questions or comments or seek any additional information on Lux Trading Firm, please email <a href=\"mailto:info@lux-trading-firm.com\">info@lux-trading-firm.com<\/a>.<\/p>\n<p>Inquiries or other correspondence for the Designated Agent should be sent to the above electronic address.<\/p>\n<h4><strong>3. Services<\/strong><\/h4>\n<p>The Service provided is a Simulated Account where your performance is evaluated across two steps for the opportunity to get funded with the trading capital of Lux Trading Firm.<\/p>\n<h4><strong>4. Eligibility<\/strong><\/h4>\n<p>You represent and warrant that you are at least 18 years of age. In jurisdictions, territories, and locations where the minimum age for permissible use of the Sites or Services is greater than 18 years of age, you represent and warrant that you meet the age requirement for the minimum age for permissible use of the Sites or Services. If you are under the minimum age for permissible use of the Sites or Services in your jurisdiction, territory, or location, you may not utilize the Sites or Services.<\/p>\n<p>You are solely responsible for ensuring that these Terms are in compliance with all laws, rules and regulations applicable to you. The right to access the Sites or Services is revoked where these Terms or use of the Sites or Services are prohibited or to the extent offering, sale or provision of the Sites or Services conflicts with any applicable law, rule or regulation. The Sites or Services are offered only for your use, and not for the use or benefit of any third party.<\/p>\n<p>You may not, without our prior written consent, access Lux Trading Firm Services (i) for production purposes, (ii) if you are a competitor of Lux Trading Firm, (iii) to monitor the availability, performance or functionality of the Lux Trading Firm Sites or Services, or (iv) for other benchmarking or competitive purposes.<\/p>\n<h4><strong>5. Not a Broker-Dealer<\/strong><\/h4>\n<p>You acknowledge and agree that we are not a broker-dealer, as such term is used in EU financial services regulations, and that we do not trade securities on our or another party’s behalf as part of the Sites or Services, nor do we directly offer any financial advice of our own as part of the Sites or Services. You acknowledge and agree that we are not liable for any losses or gains that may arise from your reliance upon information provided through the Sites or Services or your interaction with other Users.<\/p>\n<h4><strong>6. Reliance on Information Shown on our Sites or Services (Content Provided by Lux Trading Firm)<\/strong><\/h4>\n<p>The information presented on or through Lux Trading Firm Sites or Services includes financial and market information. Such information is made available solely for entertainment and general information purposes. We do not warrant the accuracy, completeness, timeliness or usefulness of such information and such information has not been verified. Any reliance you place on such information is strictly at your own risk. We do not invite that any action be taken upon the information we provide. We disclaim all liability and responsibility arising from any reliance placed on such materials by you or any other visitor to our Sites or Services, or by anyone who may be informed of any of its contents.<\/p>\n<p>The information presented has been prepared without regard to individual investment objectives, financial situations or means. Such information is not intended to constitute investment advice and is not designed to meet your personal financial situation. Many of the investments described on or through our Sites or Services involve significant risks, and any discussion of risks contained on the Sites or Services should not be considered a complete discussion of risks involved. We recommend that you consult with your financial advisers about investment options and whether any investment may be appropriate for your specific needs prior to making any investments. You acknowledge and agree that you have sole responsibility for your investment decisions and that you should not rely solely on any information provided through the Sites or Services with regard to any investment decisions you make.<\/p>\n<p>The information and material provided on the Sites or Services is not to be construed as an offer to buy or sell, or the solicitation of an offer to buy or sell, any security, financial product, or instrument, or to participate in any particular trading strategy.<\/p>\n<p>We use reasonable efforts to maintain the Sites or Services, but we are not responsible for any defects or failures associated with the Sites or Services, any content posted on the Sites or Services, any widgets or similar applications use, or any damages (including lost profits or other consequential damages, even if we have been informed of the same) that may result from any such defects or failures. The Sites or Services may be inaccessible or inoperable for any reason, including: (i) equipment malfunctions, (ii) periodic maintenance procedures or repairs which we may undertake from time to time, or (iii) causes beyond the control of Lux Trading Firm or which are not foreseeable by Lux Trading Firm.<\/p>\n<p>Our Sites or Services include content provided by third parties, including materials provided by other users, company owners, bloggers and third-party licensors, syndicators, aggregators and\/or reporting services. All statements and\/or opinions expressed in any such materials, and all articles and responses to questions and other content, other than the content provided by us, are solely the opinions and the responsibility of the person or entity providing those materials. Any such materials do not necessarily reflect our opinion and have not been verified by us. The information in such publications may become outdated, and we have no obligation to update it. We are not responsible or liable to you or any third party for the content or accuracy of any materials provided by any third parties whether shown on the Sites or Services or otherwise.<\/p>\n<p>If any of our Sites contain links to other sites and resources provided by third parties, those links are provided for your convenience only. This includes links contained in advertisements, including banner advertisements and sponsored links. We have no control over the contents of those sites or resources and accept no responsibility for them or for any loss or damage that may arise from your use of them. If you decide to access any of the third-party Websites linked to our Sites or Services, you do so entirely at your own risk and subject to the terms of use for such Websites.<\/p>\n<p>Lux Trading Firm does not promote any financial instruments on the Sites or Services. Lux Trading Firm does not receive any compensation from companies whose financial instruments appear on the Sites or Services.<\/p>\n<p>We take no responsibility and assume no liability for any User Content. We have no obligation to pre-screen or monitor User Content. We reserve the right, upon notification or flagging from a third party, to delete or edit User Content, in whole or in part, in our sole discretion at any time and without notice.<\/p>\n<p>ALL CONTENT PRESENT ON THE SITE IS PROVIDED “AS IS,” WITHOUT ANY WARRANTIES CONCERNING THE CONTENT’S NATURE OR ACCURACY, EITHER WHEN POSTED OR AS A RESULT OF THE PASSAGE OF TIME, AND WITHOUT ANY REPRESENTATIONS OR GUARANTEES.<\/p>\n<h4><strong>7. Commodity Futures Trading Commission Disclaimer<\/strong><\/h4>\n<p>CFTC RULE 4.41 – ALL HYPOTHETICAL OR SIMULATED PERFORMANCE RESULTS HAVE CERTAIN LIMITATIONS. UNLIKE THE RESULTS SHOWN IN AN ACTUAL PERFORMANCE RECORD, SIMULATED RESULTS DO NOT REPRESENT ACTUAL TRADING. ALSO, BECAUSE THE TRADES HAVE NOT ACTUALLY BEEN EXECUTED, THE RESULTS MAY HAVE UNDER-OR OVER-COMPENSATED FOR THE IMPACT, IF ANY, OF CERTAIN MARKET FACTORS, SUCH AS LACK OF LIQUIDITY. SIMULATED OR HYPOTHETICAL TRADING PROGRAMS IN GENERAL ARE ALSO SUBJECT TO THE FACT THAT THEY ARE DESIGNED WITH THE BENEFIT OF HINDSIGHT. NO REPRESENTATION IS BEING MADE THAT ANY ACCOUNT WILL OR IS LIKELY TO ACHIEVE PROFITS OR LOSSES SIMILAR TO THOSE BEING SHOWN.<\/p>\n<p><strong>8. Third-Party Services<\/strong><\/p>\n<p>Our Sites or Services may refer to Third-Party Services. You are responsible for performing your own due diligence and evaluating whether any Third-Party Services are appropriate for you. You agree that Lux Trading Firm is not responsible for any injury, harm, damages, or negative experience you may encounter by accessing or using such Third-Party Services. If you access, visit, or use any Third-Party Services referred to on our Sites or Services, you do so at your own risk.<\/p>\n<h4><strong>9. Disclaimer of Warranties<\/strong><\/h4>\n<p>Lux Trading Firm EXPRESSLY DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, WITH RESPECT TO THE CONTENT INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. Lux Trading Firm DOES NOT WARRANT OR REPRESENT THAT THE FUNCTIONS OR OPERATIONS OF Lux Trading Firm SITES OR SERVICES WILL BE UNINTERRUPTED OR ERROR-FREE, THAT DEFECTS WILL BE CORRECTED, OR THAT Lux Trading Firm SITES OR SERVICES, ITS SERVERS, OR ANY E-MAIL SENT FROM TOPSTEP ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS.<\/p>\n<p>Lux Trading Firm DOES NOT WARRANT THAT YOUR ACTIVITIES OR USE OF THE SITES OR SERVICES ARE LAWFUL IN ANY PARTICULAR JURISDICTION AND, IN ANY EVENT, Lux Trading Firm SPECIFICALLY DISCLAIMS SUCH WARRANTIES. BY USING THE SITES OR SERVICES, YOU ACT AT YOUR OWN RISK, AND YOU REPRESENT AND WARRANT THAT YOUR ACTIVITIES ARE LAWFUL IN EVERY JURISDICTION WHERE YOU ACCESS OR USE THE SITES OR SERVICES.<\/p>\n<p>WITHOUT LIMITING THE ABOVE, Lux Trading Firm DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, NON-INFRINGEMENT, SECURITY OR ACCURACY WITH REGARD TO ANY LINKED WEBSITE. Lux Trading Firm DOES NOT ENDORSE AND IS NOT RESPONSIBLE FOR THE CAPABILITIES OR RELIABILITY OF ANY PRODUCT OR SERVICE OBTAINED FROM A LINKED WEBSITE.<\/p>\n<p>THE INFORMATION, PRODUCTS, SOFTWARE OR SERVICE DESCRIPTIONS PUBLISHED ON OUR SITE OR ON A LINKED WEBSITE MAY INCLUDE INACCURACIES OR TYPOGRAPHICAL ERRORS. THE COMPANY DISCLAIMS LIABILITY FOR SUCH ERRORS AND DOES NOT WARRANT OR REPRESENT THAT THE CONTENT ON OUR SITE OR A LINKED WEBSITE IS UPDATED OR COMPLETE. Lux Trading Firm HAS NO OBLIGATION TO UPDATE ANY CONTENT ON OUR SITE AND MAY CHANGE OR IMPROVE OUR SITE AT ANY TIME WITHOUT NOTICE.<\/p>\n<p>WE DO NOT ENDORSE AND ARE NOT RESPONSIBLE FOR THE ACCURACY OR RELIABILITY OF ANY OPINION, ADVICE, OR STATEMENT MADE THROUGH OUR SITES OR SERVICES BY ANY PARTY OTHER THAN US.<\/p>\n<h4><strong>10. Limitation of Liabilities<\/strong><\/h4>\n<p>IN NO EVENT WILL Lux Trading Firm, ITS PARENTS, SUBSIDIARIES, PARTNERS, OR AFFILIATES, OR THE RESPECTIVE SERVICE PROVIDERS, EMPLOYEES, AGENTS, OFFICERS, AND DIRECTORS OF EACH BE LIABLE TO YOU FOR ANY INCIDENTAL, SPECIAL, PUNITIVE, EXEMPLARY, OR CONSEQUENTIAL DAMAGES, INCLUDING ANY LOST PROFITS OR LOST OPPORTUNITY, EVEN IF YOU HAVE NOTIFIED US ABOUT THE POSSIBILITY OF SUCH DAMAGES, OR FOR ANY CLAIMS BY ANY THIRD PARTIES, ARISING OUT OF OR IN ANY WAY RELATED TO THE ACCESS, USE, OR CONTENT OF OUR SITES OR SERVICES OR A LINKED WEBSITE WHETHER SUCH CLAIMS ARE BROUGHT UNDER ANY THEORY OF LAW OR EQUITY.<\/p>\n<p>IN NO EVENT WILL OUR LIABILITY FOR ANY CLAIM OF ANY KIND, WHETHER BASED IN CONTRACT, WARRANTY, TORT, STRICT LIABILITY, OR OTHERWISE, FOR ANY LOSSES OR DAMAGES ARISING OUT OF, CONNECTED WITH, OR RESULTING FROM, THESE TERMS OR THE PERFORMANCE OR BREACH THEREOF, OR ANY PRODUCT OR SERVICE OR THE USE OR PERFORMANCE THEREOF, EXCEED THE GREATER OF (i) THE AMOUNT PAID BY YOU TO Lux Trading Firm IN THE IMMEDIATELY PRECEDING MONTH FOR Lux Trading Firm PRODUCTS OR SERVICES OR (ii) $100.<\/p>\n<p>THIS LIMITATION ON LIABILITY INCLUDES TRANSMISSION OF VIRUSES THAT INFECTS YOUR EQUIPMENT, MECHANICAL OR ELECTRONIC EQUIPMENT FAILURE, FAILURE OF COMMUNICATION LINES, TELEPHONE, OR OTHER INTERCONNECTS, UNAUTHORIZED ACCESS, THEFT, OPERATIONAL ERRORS, OR ANY FORCE MAJEURE.<\/p>\n<h4><strong>11. Purchases; Credit Card and Other Financial Information<\/strong><\/h4>\n<p>Certain Sites of Lux Trading Firm allows Users to place Orders. Upon placing an Order, you shall pay to Lux Trading Firm the purchase price as set forth in the “Order Summary” page or similar ordering mechanism. Lux Trading Firm or its third-party affiliates may utilize the services of certain third-party payment processors to process payments of credit cards and other accepted methods of payment. Your purchase is subject to any additional terms and conditions imposed by such third-party payment processors. The purchase price and any applicable fees or taxes shall be applied to your chosen method of payment upon submission of your Order.<\/p>\n<p>Upon the purchase of an Order or other service rendered by Lux Trading Firm through the Sites or Services, you acknowledge that Lux Trading Firm will provide availability and access to the service requested. Your participation in, or failure to use, such purchased service does not entitle you to a refund.<\/p>\n<p>Prices and availability of products are subject to change without notice. Errors will be corrected where discovered, and Lux Trading Firm reserves the right to revoke any stated offer and to correct any errors, inaccuracies, or omissions including after an Order has been submitted and whether or not the Order has been confirmed and your payment method accepted and charged. In the event your payment method has been accepted and charged, Lux Trading Firm will issue you the appropriate credit within a reasonable time after your Order has been revoked.<\/p>\n<p>Lux Trading Firm accepts payments via credit and debit card through our Sites or Services. Certain Credit Card Information and Debit Card Information will be encrypted and received via a secure page. You represent and warrant that you are an authorized signatory of the credit or debit card or other method of payment that you provide to Lux Trading Firm or its third-party payment processor to pay any fees or taxes related to your purchases of products or services through our Sites or Services.<\/p>\n<p>We use industry standard technology and commercially reasonable measures to protect Credit Card and Debit Card Information from misuse. Lux Trading Firm may utilize the services of certain third-party payment processors to process payments of credit cards and other accepted methods of payment.<\/p>\n<p>If you are directed to a third-party Website to make purchases, your purchase will be governed by the terms of such third-party Website. If you desire to supply Credit Card Information, Personal Data or financial information to any third-party service provider or to any Linked Website, you do so at your own risk and discretion. We strongly recommend you review the terms and conditions and privacy policy of any third party before providing such information. Lux Trading Firm is not responsible should you provide such information to any third party and is not responsible for the use of such information by any third party.<\/p>\n<p>The purchase of any of our services, including free ones (and specifically the free trial) entitles lux and the broker, AfterPrime, to contact you in relation to the related services in general.<\/p>\n<h4><strong>12. Linking to Our Sites<\/strong><\/h4>\n<p>You may link to our Sites or Services, provided that (i) you do so in a way that is fair, in compliance with all applicable laws, rules and regulations, and does not damage our reputation; and (ii) you shall not establish a link in such a way as to suggest any form of association, approval, or endorsement on our part without our express written consent.<\/p>\n<h4><strong>13. Restricted Sites and Passwords\/User Registration<\/strong><\/h4>\n<p>Certain functionality of the Sites or Services is limited to Users who have registered an Account for the applicable services. Such Users will have unique User Credentials issued for their Account. You represent and warrant that all Account information is truthful and accurate, and you will update such information to ensure its accuracy. You represent and warrant that you have provided a valid email address at the time of registration. You agree that all information you provide to register with our Sites or Services or otherwise, including through the use of any interactive features on our Sites or Services, is governed by our Privacy Policy, and you consent to all actions we take with respect to your information consistent with our Privacy Policy. You may update your personal information through our Sites or Services or by contacting us via the contact information provided above.<\/p>\n<p>Users are responsible for the confidentiality of User Credentials and shall be responsible and liable for access to or use of the Sites or Services by such User or any other person or entity using such User Credentials (whether or not such access has been authorized). You agree that access to the Account will be limited to the User which subscribed under such account. You agree to immediately notify Lux Trading Firm if you learn of, or have reason to suspect, any unauthorized use of your account or any other breach of security.<\/p>\n<p>You acknowledge and agree that Lux Trading Firm is authorized to act on all instructions received through your Account, and that Lux Trading Firm may, but is not obligated to, deny access or block any transaction made through use of your Account without prior notice if we believe that such Account is being used by someone other than its registered User, or for any other reason.<\/p>\n<p>Lux Trading Firm reserves the right to refuse to grant User Credentials to any individual for any reason, including, if such User impersonates someone else, is protected by trademark or other proprietary rights law, or is vulgar or offensive. Lux Trading Firm shall not be liable for any loss or damage arising from a User’s failure to comply with this Section.<\/p>\n<h4><strong>14. Submitting Content or Comments on Our Sites (Content Provided by You)<\/strong><\/h4>\n<p>If you submit User Content, you agree to abide by these Terms.<\/p>\n<p>You shall not submit User Content on our Sites or Services that is: illegal, indecent, profane (either directly or indirectly through partially obscured words, letters, phrases, terminology or the like), threatening, defamatory, derogatory, counter to Lux Trading Firm Privacy Policy or otherwise injurious to Lux Trading Firm or any third parties, constitutes commercial solicitation or advertising (except where pre-approved in writing by Lux Trading Firm), or consist primarily of an unsolicited electronic mass mailing.<\/p>\n<p>User Content shall not be abusive or harassing to any person. You may not submit materials that are or purport to be the personally identifiable information about others, such as full name, postal address, email address, telephone number, or any other personal attribute which would constitute an invasion of privacy. User Content shall not be obscene, objectionable, offensive, tortious, deceptive, fraudulent, or invasive of another’s privacy or publicity rights.<\/p>\n<p>While Lux Trading Firm takes all reasonable measures to ensure that User Content remains private, Lux Trading Firm does not guarantee that User Content will remain private, even if such User Content is entered into a password-protected section of the Sites or Services. Accordingly, you should not provide User Content that you want protected from others.<\/p>\n<p>User Content shall not contain a software virus, worm, spyware, Trojan horse, or other computer code, file or program designed to interrupt, impair, destroy, or limit the functionality of any computer software or hardware or telecommunications equipment.<\/p>\n<p>User Content shall not infringe in any manner on the copyright, trademark, or other intellectual property rights of any person or entity, and shall not contain privileged, confidential, proprietary, or trade-secret information of any individual or entity, or any information that may violate the legal right of any person or entity in any jurisdiction or locale.<\/p>\n<p>If you wish to submit materials to any of our Sites or Services, you are prohibited from impersonating any other individual or entity, or otherwise misleading any person or entity as to the origin of the comments.<\/p>\n<p>You agree to disclose any conflict of interest, ownership interest, business, employment, or other financial relationship you have with any company or financial instruments named in any User Content. You agree not to submit User Content with the intent to increase or decrease a financial instrument’s price and sell or purchase such financial instrument because of such increase or decrease. If you submit User Content about any stock or financial instrument while intending to purchase or sell such stock or a related financial instrument within 72 hours, any such User Content shall include a statement regarding your intended purchase or sale.<\/p>\n<p>You shall not submit User Content that violates any local, state, national, or international law, including but not limited to regulations of the U.S. Securities and Exchange Commission and the U.S. Commodity Futures Trading Commission or other securities laws and the rules of any securities exchange. You agree that User Content will not constitute illegal activity, give rise to civil liability, or violate the contractual, personal, intellectual property, or other rights of any other party.<\/p>\n<h4><strong>15. Content License<\/strong><\/h4>\n<p>By submitting User Content, you grant Lux Trading Firm an unrestricted, worldwide, non-exclusive, irrevocable, perpetual, fully paid-up and royalty-free right and license (the “License”), in any form or format, in whole or in part, to host, store, maintain, use, reproduce, distribute, display, publish, modify, prepare derivative works of, and otherwise exploit all or any portion of such User Content on the Sites or Services and on any other websites, channels, or distribution platforms, for any purpose whatsoever, without accounting, notification, credit or other obligation to you, and the right to license and sublicense and authorize others to exercise any of the rights granted hereunder to Lux Trading Firm, in its sole discretion. All rights, licenses and privileges herein described are granted to Lux Trading Firm immediately upon submission of User Content and shall continue perpetually and indefinitely. Any information that you wish to remain private should not be submitted with or as User Content.<\/p>\n<p>Furthermore, your submission of User Content signifies your representation and warranty of the following:<\/p>\n<ul>\n<li>You have the right to submit the User Content and grant the License herein described;<\/li>\n<li>No further licenses, royalties, or permissions will be needed from a third party to use your User Content as herein described;<\/li>\n<li>User Content does not infringe any third party’s rights, including intellectual property and privacy rights; and<\/li>\n<li>User Content complies with Terms and all applicable laws.<\/li>\n<\/ul>\n<h4><strong>16. Intellectual Property, Trademarks, and Copyrights<\/strong><\/h4>\n<p>Lux Trading Firm Sites or Services and their entire contents, features, and functionality (including all information, software, text, displays, images, video and audio, and the design, selection, and arrangement thereof), are owned by Lux Trading Firm, its licensors, or other providers of such material and are protected by United States and international copyright, trademark, patent, trade secret, and other intellectual property or proprietary rights laws and treaties. You shall not challenge the ownership or rights in Lux Trading Firm Sites or Services or any component thereof.<\/p>\n<p>You are granted a nonexclusive, nontransferable, limited, and revocable right to access, use, display, and navigate our Sites and Services solely for your personal, non-commercial, and non-public use. You shall not reproduce, distribute, modify, create derivative works of, publicly display, publicly perform, republish, download, store, or transmit any of our material, except for your personal, non-commercial, and non-public use. You shall not access or use for any commercial purposes any part of our Sites or Services.<\/p>\n<p>If you print, copy, modify, download, or otherwise use or provide any other person with access to any part of our Sites or Services in breach of these Terms, your right to use Lux Trading Firm Sites and Services will cease immediately, and you must, at our option, return, or destroy any copies of the materials you have made. No right, title, or interest in or to our Sites or Services or any content on our Sites or Services is transferred to you, and all rights not expressly granted herein are reserved by Lux Trading Firm. Any use of our Sites or Services not expressly permitted by these Terms is a breach of these Terms and may violate copyright, trademark, trade secret, and other laws.<\/p>\n<p>The Marks displayed on Lux Trading Firm Sites and Services are the property of Lux Trading Firm, unless otherwise disclosed. You are prohibited from using, removing, or altering any Marks for any purpose including use on other materials, in presentations, as domain names, or as meta-tags, without our written permission.<\/p>\n<p>Except as expressly provided above, no Intellectual Property displayed on Lux Trading Firm Sites or Services or on any of the Content may be reproduced, altered, removed, transmitted, published, or distributed, whether electronically, mechanically, by photocopy, recording or otherwise, without the prior written permission of Lux Trading Firm. Use of any Lux Trading Firm trademarks as metatags on any third-party site is strictly prohibited. You may not Co-brand our Sites or display our Sites in frames (or any of the Content via in-line links) without prior written permission from Lux Trading Firm. You agree to cooperate with Lux Trading Firm in causing any unauthorized co-branding, framing, or linking to immediately cease. You may not remove, modify, or alter any copyright, trademark, or patent notice from any product delivered by us. You agree not to undertake any action that will interfere with or diminish our right, title, or interest in our Intellectual Property.<\/p>\n<h4><strong>17. Digital Millennium Copyright Act<\/strong><\/h4>\n<p>The following policy has been adopted pursuant to the Digital Millennium Copyright Act (found at <a href=\"http:\/\/lcweb.loc.gov\/copyright\/legislation\/dmca.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">http:\/\/lcweb.loc.gov\/copyright\/legislation\/dmca.pdf<\/a>):<\/p>\n<p>The address of the Designated Agent can be found above in Section 2. If you believe that content or material provided through the Sites or Services infringes a copyright, please send a notice containing the following information to the Designated Agent:<\/p>\n<ul>\n<li>a physical or electronic signature of a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed;<\/li>\n<li>identification of the material claimed to have been infringed or, if multiple works, a representative list of such works;<\/li>\n<li>identification of the material that is claimed to be infringing or the subject of infringing activity and that is to be removed or access to which is to be disabled, and information reasonably sufficient to permit us to locate the material;<\/li>\n<li>information reasonably sufficient to permit us to contact you, such as an address, telephone number, and, if available, an email address at which you may be contacted;<\/li>\n<li>a statement that you have a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent, or the law; and<\/li>\n<li>statement that the information in the notification is accurate, and under penalty of perjury, that the complaining party is authorized to act on behalf of the owner of an exclusive right that is allegedly infringed.<\/li>\n<\/ul>\n<h4><strong>18. Termination<\/strong><\/h4>\n<p>Users may terminate receipt of any free service publications at any time by sending Lux Trading Firm a request for removal from the relevant distribution list. All free service publication emails will include a link allowing a User to unsubscribe. If you wish to terminate receipt of such publications, please use the link on the attached email or see the contact information provided in Section 2.<\/p>\n<p>Lux Trading Firm reserves the right to refuse to permit your access or to terminate your access to any of the Lux Trading Firm Sites or Services at any time at its sole discretion. Such termination may result from a violation of the Terms or other referenced agreements, unauthorized use or reproduction of any publication or information, or any or no reason, all determined in Lux Trading Firm sole discretion. If such access is refused or terminated, you agree you will not attempt to establish a new Account under any name, real or assumed. All provisions of these Terms shall survive termination, including, ownership provisions, warranty disclaimers, indemnities, and limitations of liability.<\/p>\n<h4><strong>19. Jurisdiction and Enforceability<\/strong><\/h4>\n<p>These Terms shall be governed by and construed in accordance with the laws of Slovakia, without giving effect to any principles of conflicts of law. You irrevocably consent to the exclusive jurisdiction of the courts located in the UK, in connection with any action arising out of or related to these Terms or their subject matter. You waive any objection based on lack of personal jurisdiction, place of residence, improper venue, or forum non convenience in any such action.<\/p>\n<h4><strong>20. Force Majeure<\/strong><\/h4>\n<p>We will not be liable or responsible for any failure to perform, or delay in performance of, any of our obligations under these Terms that is caused by a Force Majeure Event. If a Force Majeure Event takes place that affects the performance of our obligations under these Terms, we will contact you as soon as reasonably possible to notify you. Our obligations under these Terms will be suspended and the time for performance of our obligations will be extended for the duration of a Force Majeure Event.<\/p>\n<p><strong>21. Waiver of Class Action Rights<\/strong><\/p>\n<p>IN ANY DISPUTE, NEITHER YOU NOR ANY OTHER PERSON SHALL BE ENTITLED TO JOIN OR CONSOLIDATE CLAIMS BY OR AGAINST OTHER AFFILIATES OR PERSONS OR ARBITRATE ANY CLAIM AS A REPRESENTATIVE OR CLASS ACTION OR IN A PRIVATE ATTORNEY GENERAL CAPACITY. YOU ACKNOWLEDGE THAT YOU ARE GIVING UP YOUR RIGHTS TO PARTICIPATE IN A CLASS ACTION OR REPRESENTATIVE ACTION WITH RESPECT TO ANY SUCH CLAIM.<\/p>\n<h4><strong>22. Indemnification<\/strong><\/h4>\n<p>You agree to indemnify, defend, and hold the Lux Trading Firm Parties harmless, including costs, liabilities and legal fees, from any claim or demand made by any third-party arising out of or relating to (i) your access to or use of our Sites or Services, (ii) your violation of the Terms, (iii) the infringement by you, or any third party using your account, of any intellectual property or other right of any person or entity, (iv) any funding of your account from any source and any payment methods used. Lux Trading Firm reserves the right, at your expense, to assume the exclusive defense and control of any matter for which you are required to indemnify us, and you agree to cooperate with our defense of these claims. You agree not to settle any such matter without the prior written consent of Lux Trading Firm. Lux Trading Firm will use reasonable efforts to notify you of any such claim, action, or proceeding upon becoming aware of it.<\/p>\n<h4><strong>23. Other Prohibited Uses<\/strong><\/h4>\n<p>You are solely responsible for any and all acts and omissions that occur under your Account, and you agree not to engage in unacceptable use of the Sites or Services or any User Content including:<\/p>\n<ul>\n<li>Posting, storing, or disseminating any unsolicited or unauthorized advertising, promotional materials, junk mail, spam, chain letters or other fraudulent schemes, or any other form of solicitation;<\/li>\n<li>Using any manual or automated software, devices, or other processes to “crawl” or “spider” any web pages contained in the Sites or Services;<\/li>\n<li>Using the Sites or Services to gain competitive intelligence about Lux Trading Firm or the Sites or Services to compete with Lux Trading Firm or its affiliates; and<\/li>\n<li>Harvesting or otherwise collecting any information about other users, including, email addresses or other contact information<\/li>\n<\/ul>\n<h4><strong>24. Restrictive Covenants<\/strong><\/h4>\n<p>For a period of 2 years from your accepting of these Terms of Use, you agree not to, directly or indirectly, (i) engage in or assist others in engaging in the Restricted Business in the EU; or (ii) cause, induce, solicit, or encourage any client, partner, affiliate, or customer of Lux Trading Firm to terminate or modify its relationship with Lux Trading Firm.<\/p>\n<h4><strong>25. Other Important Terms<\/strong><\/h4>\n<p>These Terms are in addition to any other agreements between you and Lux Trading Firm:<\/p>\n<p>Nothing in these Terms shall create or be deemed to create a partnership, agency, trust arrangement, fiduciary relationship, or joint venture between you and Lux Trading Firm. Neither you nor Lux Trading Firm shall have any right, power, or authority to act or create any obligation, express or implied, on behalf of the other party.<\/p>\n<p>You agree that breach of the provisions of these Terms would cause irreparable harm and significant injury to Lux Trading Firm which would be both difficult to ascertain and which would not be compensable by damages alone. As such, you agree that Lux Trading Firm has the right to enforce the provisions of these Terms by injunction (without necessity of posting bond), specific performance, or other equitable relief without prejudice to any other rights and remedies Lux Trading Firm may have for your breach of these Terms.<\/p>\n<p>We reserve the right at any time in our sole discretion to: modify, suspend, or discontinue our Sites or Services or any service, content, feature, or product offered through our Sites or Services, with or without notice; charge fees in connection with the use of our Sites and Services; modify and\/or waive any fees charged in connection with our Sites or Services; and\/or offer opportunities to some or all users of our Sites or Services. You agree that we shall not be liable to you or to any third party for any modification, suspension, or discontinuance of our Sites or Services, or any service, content, feature, or product offered through our Sites or Services.<\/p>\n<p>Each of the paragraphs of these Terms operates separately. If any court or relevant authority decides that any of them are unlawful or unenforceable, the remaining paragraphs will remain in full force and effect.<\/p>\n<p>If we fail to insist that you perform any of your obligations under these Terms, or if we do not enforce our rights against you, or if we delay in doing so, that will not mean that we have waived our rights against you and will not mean that you do not have to comply with those obligations. If we do waive a default by you, we will only do so in writing, and that will not mean that we will automatically waive any later default by you.<\/p>\n<p>We may terminate these Terms at any time without notice, and accordingly may deny you access to our Sites and Services, if in our sole judgment you fail to comply with any term or provision of these Terms. The obligations and liabilities of the parties incurred prior to the termination date shall survive the termination of these Terms for all purposes.<\/p>\n<h4><strong>26. Acceptance of, and Modifications to, These Terms<\/strong><\/h4>\n<p>We assume that all Users have read this document and agree to its content. If you do not agree with these Terms, you should refrain from using our Sites and Services.<\/p>\n<p>These Terms may change from time to time. If we modify our Terms, we will notify you and post the revised statement here, with an updated revision date. If you do not agree to any changes to these Terms of Use after receipt of notice, you shall discontinue your use of the Sites or Services.<\/p>\n<h4><strong>27. Feedback<\/strong><\/h4>\n<p>Lux Trading Firm welcomes your Feedback. If you submit Feedback to Lux Trading Firm, please note that your Feedback shall become the property of Lux Trading Firm, and you hereby irrevocably assign to Lux Trading Firm all right, title, and interest in and to the Feedback and all copyrights and other intellectual property rights embodied in such Feedback on a worldwide basis.[\/vc_column_text][\/vc_column_inner][\/vc_row_inner][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; crypterium_vc_row_jarallax=&#8221;yes&#8221; el_id=&#8221;intro&#8221; p_img=&#8221;2015&#8243; crypterium_vc_row_jarallax_speed=&#8221;0.3&#8243;][vc_column][\/vc_column][\/vc_row][vc_row full_width=&#8221;stretch_row&#8221; crypterium_vc_row_overflow=&#8221;hidden&#8221; css=&#8221;.vc_custom_1608118807347{padding-top: 100px !important;padding-bottom: 50px !important;}&#8221;][vc_column][vc_row_inner][vc_column_inner][vc_column_text css=&#8221;.vc_custom_1680516036161{margin-bottom: 60px !important;}&#8221;]These Terms of Use govern access to and the use of the Sites or Services of Lux Trading Firm, a UK private company, by our account holders, users, and visitors (“you”, “your”, or “User”), however such Sites or Services are accessed,&#8230;<\/p>\n","protected":false},"author":198174107,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"custom-page.php","meta":{"_coblocks_attr":"","_coblocks_dimensions":"","_coblocks_responsive_height":"","_coblocks_accordion_ie_support":"","_mo_disable_npp":"","_starter_page_template":""},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v20.5 (Yoast SEO v20.5) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms of use - Lux Trading Firm<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/luxtradingfirm.com\/terms-of-use\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms of use\" \/>\n<meta property=\"og:description\" content=\"These Terms of Use govern access to and the use of the Sites or Services of Lux Trading Firm, a UK private company, by our account holders, users, and\" \/>\n<meta property=\"og:url\" content=\"https:\/\/luxtradingfirm.com\/terms-of-use\/\" \/>\n<meta property=\"og:site_name\" content=\"Lux Trading Firm\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/\" \/>\n<meta property=\"article:modified_time\" content=\"2023-04-03T10:00:39+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/Capture2-1-1024x733.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"733\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@FirmLux\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"31 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/luxtradingfirm.com\/terms-of-use\/\",\"url\":\"https:\/\/luxtradingfirm.com\/terms-of-use\/\",\"name\":\"Terms of use - Lux Trading Firm\",\"isPartOf\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#website\"},\"datePublished\":\"2020-12-16T11:27:47+00:00\",\"dateModified\":\"2023-04-03T10:00:39+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/luxtradingfirm.com\/terms-of-use\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/luxtradingfirm.com\/terms-of-use\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/luxtradingfirm.com\/terms-of-use\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/luxtradingfirm.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Terms of use\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/luxtradingfirm.com\/#website\",\"url\":\"https:\/\/luxtradingfirm.com\/\",\"name\":\"Lux Trading Firm\",\"description\":\"Funded Forex Trading Program\",\"publisher\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/luxtradingfirm.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/luxtradingfirm.com\/#organization\",\"name\":\"Lux Trading Firm\",\"url\":\"https:\/\/luxtradingfirm.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1\",\"width\":3400,\"height\":1104,\"caption\":\"Lux Trading Firm\"},\"image\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/\",\"https:\/\/twitter.com\/FirmLux\",\"https:\/\/www.instagram.com\/luxtradingfirm\/\",\"https:\/\/www.youtube.com\/channel\/UCZydph7k_5BXAgHIedXPoKg\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Terms of use - Lux Trading Firm","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/luxtradingfirm.com\/terms-of-use\/","og_locale":"en_US","og_type":"article","og_title":"Terms of use","og_description":"These Terms of Use govern access to and the use of the Sites or Services of Lux Trading Firm, a UK private company, by our account holders, users, and","og_url":"https:\/\/luxtradingfirm.com\/terms-of-use\/","og_site_name":"Lux Trading Firm","article_publisher":"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/","article_modified_time":"2023-04-03T10:00:39+00:00","og_image":[{"width":1024,"height":733,"url":"https:\/\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/Capture2-1-1024x733.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_site":"@FirmLux","twitter_misc":{"Est. reading time":"31 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/luxtradingfirm.com\/terms-of-use\/","url":"https:\/\/luxtradingfirm.com\/terms-of-use\/","name":"Terms of use - Lux Trading Firm","isPartOf":{"@id":"https:\/\/luxtradingfirm.com\/#website"},"datePublished":"2020-12-16T11:27:47+00:00","dateModified":"2023-04-03T10:00:39+00:00","breadcrumb":{"@id":"https:\/\/luxtradingfirm.com\/terms-of-use\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/luxtradingfirm.com\/terms-of-use\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/luxtradingfirm.com\/terms-of-use\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/luxtradingfirm.com\/"},{"@type":"ListItem","position":2,"name":"Terms of use"}]},{"@type":"WebSite","@id":"https:\/\/luxtradingfirm.com\/#website","url":"https:\/\/luxtradingfirm.com\/","name":"Lux Trading Firm","description":"Funded Forex Trading Program","publisher":{"@id":"https:\/\/luxtradingfirm.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/luxtradingfirm.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/luxtradingfirm.com\/#organization","name":"Lux Trading Firm","url":"https:\/\/luxtradingfirm.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/","url":"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1","contentUrl":"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1","width":3400,"height":1104,"caption":"Lux Trading Firm"},"image":{"@id":"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/","https:\/\/twitter.com\/FirmLux","https:\/\/www.instagram.com\/luxtradingfirm\/","https:\/\/www.youtube.com\/channel\/UCZydph7k_5BXAgHIedXPoKg"]}]}},"jetpack_shortlink":"https:\/\/wp.me\/PcDwIy-sC","amp_enabled":true,"_links":{"self":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages\/1774"}],"collection":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/users\/198174107"}],"replies":[{"embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/comments?post=1774"}],"version-history":[{"count":10,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages\/1774\/revisions"}],"predecessor-version":[{"id":30659,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages\/1774\/revisions\/30659"}],"wp:attachment":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/media?parent=1774"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}