{"id":1782,"date":"2020-12-16T11:44:25","date_gmt":"2020-12-16T11:44:25","guid":{"rendered":"http:\/\/microwebtechnology.com\/luxtradingfirm\/?page_id=1782"},"modified":"2023-04-03T10:48:44","modified_gmt":"2023-04-03T09:48:44","slug":"privacy-policy-2","status":"publish","type":"page","link":"https:\/\/luxtradingfirm.com\/privacy-policy-2\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"<p>[vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; crypterium_vc_row_jarallax=&#8221;yes&#8221; el_id=&#8221;intro&#8221; p_img=&#8221;2015&#8243; crypterium_vc_row_jarallax_speed=&#8221;0.3&#8243;][vc_column]<div class=\"section-heading   col-MB- section-heading--center \" ><h1 class=\"__title\">Privacy Policy<\/h1><\/div>[\/vc_column][\/vc_row][vc_row full_width=&#8221;stretch_row&#8221; crypterium_vc_row_overflow=&#8221;hidden&#8221; css=&#8221;.vc_custom_1608118807347{padding-top: 100px !important;padding-bottom: 50px !important;}&#8221;][vc_column]<div class=\"section-heading   col-MB-35 text--left \" ><h2 class=\"__title\">Last Modified: September 21, 2022<\/h2><\/div>[vc_row_inner][vc_column_inner][vc_column_text css=&#8221;.vc_custom_1680515307063{margin-bottom: 60px !important;}&#8221;]<\/p>\n<h4><strong>1. Scope of This Privacy Policy<\/strong><\/h4>\n<p>This Privacy Policy outlines what types of information are collected from our account holders, users, and visitors(“you”, “your” or “User”), to whom it may be disclosed, and how that information may be used by Lux Trading Firm, a Slovak private company, and its affiliated entities (collectively, “Lux Trading Firm”, “we”, “our” or “us”), as each of the foregoing relates to your use of Lux Trading Firm  Web Sites ( “Sites”), software, applications, content, platforms, products, and services (each, a “ Service”, and collectively, the “ Services”). This Privacy Policy contains capitalized words or phrases throughout which are defined terms. Their definitions are found either in this Privacy Policy or the Terms of Use.<\/p>\n<p>By using the Sites or Services, you agree that you have read, understood, and consented to this Privacy Policy, our Terms of Use, all amendments, addenda, and licenses to each of the Privacy Policy and the Terms of Use (collectively, the “Agreement”). You should review the Terms of Use, along with this Privacy Policy. By using our Sites or Services, you consent to Lux Trading Firm use of your information and data as described in the Agreement. If you do not agree to the terms of this Privacy Policy, do not use the Sites or Services. Please check back periodically as Lux Trading Firm reserves the right to change, modify, add, or remove portions of this Privacy Policy after providing notice to you. The form of such notice is determined at our discretion.<\/p>\n<p>The official language used by Lux Trading Firm is English; in the event of a conflict between the English language version of this document and any version translated into any other language, the English language version shall prevail.<\/p>\n<h4><strong>2. Definitions<\/strong><\/h4>\n<p>“Account” means an account of a User that is registered with Lux Trading Firm that has access to specified Services of Lux Trading Firm.<\/p>\n<p>“Agreement” means this Privacy Policy, our Terms of Use, all amendments, addenda, and licenses to each of the Privacy Policy and the Terms of Use.<\/p>\n<p>“Authorization” means the set of rights and privileges on the Web Site assigned to a User by Lux Trading Firm.<\/p>\n<p>“Brazilian User” means a User who resides in Brazil.<\/p>\n<p>“Content” means all information and other materials present on the Sites, including Lux Trading Firm products and services, text, images, photos, trading ideas, opinions rumors, advice, charts, financial information, ratings, reviews, or similar information.<\/p>\n<p>“Controller” means a person or entity who, either alone or jointly, determines the purposes and means of the processing of Personal Data, controls the data, and is responsible for it.<\/p>\n<p>“Cookies” means small files that are placed on your hard drive for identification purposes. These files are used for site registration and customization the next time you visit us.<\/p>\n<p>“Credit Card Information” means that information required to process a credit card payment, including name of the debit card holder, credit card number, CVV number, expiration date, billing address, phone number, and email address.<\/p>\n<p>“Data” means information generated by you and other Users (whether aggregated or otherwise).<\/p>\n<p>“Data Protection Officer” means the person or entity in charge of the data processing operation.<\/p>\n<p>“Data Subject” means an identified or identifiable natural person.<\/p>\n<p>“Debit Card Information” means that information required to process a debit card payment, including name of the debit card holder, debit card number, CVV number, expiration date, billing address, phone number, and email address.<\/p>\n<p>“Designated Agent” means the Lux Trading Firm representative identified in Section 2 of the Terms of Use.<\/p>\n<p>“EU” means the European Union.<\/p>\n<p>“EU User” means a User who resides in the European Union.<\/p>\n<p>“Feedback” means your comments, feedback, information, or other materials regarding the Sites and Services.<\/p>\n<p>“GDPR” means the General Data Protection Regulation, adopted as Regulation (EU) 2016\/679 of the European Parliament on April 14, 2016.<\/p>\n<p>“LGPD” means Lei Geral de Proteção de Dado, Brazil’s Data Protection Law. The LGPD is effective on May 3, 2021.<\/p>\n<p>“Log Data” means information that your browser sends whenever you visit a website; this information is automatically recorded by our servers.<\/p>\n<p>“Personal Data” means any information relating to an identified or identifiable natural person or any information that is used for the behavior profiling of a particular natural person, if that person is identified.<\/p>\n<p>“Sensitive Data” means data that reveals racial or ethnic origin, political opinions, religious or philosophical beliefs, or trade union membership, biometric data, data that concerns health, or data that concerns a natural person’s sex life or sexual orientation.<\/p>\n<p>“Terms” means Lux Trading Firm Terms of Use.<\/p>\n<p>“User” means a natural or legal person over the age of 18 who has accepted Lux Trading Firm Terms of Use and, if applicable, has been authorized to use the Account on behalf of himself\/herself.<\/p>\n<p>“User Submission” means any comment, or personal information, including ideas, suggestions, opinions, comments, observations, or other material , posted to any public form on our Sites or Services, including any publication, article, social network page, blog, chat room, or other such forum.<\/p>\n<p>“Visitor” means a legal or natural person who visits our Site without having an Account.<\/p>\n<h4><strong>3. Lux Trading Firm as Data Controller \/ Privacy Officer<\/strong><\/h4>\n<p>This Privacy Policy applies to the information and data collected by Lux Trading Firm as a Controller. Should you have questions or requests regarding your Personal Data, you may contact Lux Trading Firm  Data Protection Officer at any time at <a href=\"mailto:info@lux-trading-firm.com\">info@lux-trading-firm.com<\/a><\/p>\n<h4><strong>4. Designated Agent<\/strong><\/h4>\n<p>Lux Trading Firm Designated Agent for purposes of the Digital Millennium Copyright Act may be contacted at <a href=\"mailto:info@lux-trading-firm.com\">info@lux-trading-firm.com<\/a><span> <\/span>Please refer to “Designated Agent” in the subject line of your email.<\/p>\n<h4><strong>5. Collection of Personal Data<\/strong><\/h4>\n<p>You may choose to register an Account with our Sites or Services, and we may collect certain personal information from you in order to provide services and to complete transactions.<\/p>\n<p>When you register with us through our Sites or Services, we will ask you for Personal Data. Personal Data may include your name, phone number, email address, postal address, username, password, zip code, and age (optional).<\/p>\n<p>Our Sites or Services may provide links to third-party applications, products, services, or web sites for your convenience and information. If you access those links, you will leave our Sites or Services. We do not control those third-party sites and services or their privacy practices, which may differ from our practices. We do not endorse or make any representations about third-party sites. Any information you choose to provide to, or that is collected by those third parties is not covered by the Agreement. We cannot control the activities of third parties, and we have no responsibility for any use of the information provided by such third parties. Any information you choose to provide to third party web sites or products will be governed by the policies of those third-party web sites and products.<\/p>\n<p>If you post a User Submission to any public forum on our Sites or Services, including any publication, article, social network page, blog, chat room, or other such forum, please be aware that any Personal Data disclosed in your User Submission can be read, viewed, collected, or used by other users of these forums, and could be used to contact you, send you unsolicited messages, or for purposes that neither you nor we control. We may also aggregate all or any part of User Submissions into a resource that we may use, share, or distribute provided that any Personal Data has been anonymized. Lux Trading Firm is not responsible for the Personal Data contained in your User Submission.<\/p>\n<h4><strong>6. Legal Basis for Collecting Your Personal Data<\/strong><\/h4>\n<p>Our legal basis for collecting and using your Personal Data will depend on the Personal Data concerned and the specific context in which we collect it. However, we will normally collect Personal Data from you only where we have your consent to do so, where we need your Personal Data to perform a contract with you, where the processing is in our legitimate interests and is not overridden by your data protection interests or fundamental rights and freedoms, and when we have a legal obligation to do so. Your consent to our Terms of Use and this Privacy Policy also constitutes the legal basis upon which we may collect your Personal Data.<\/p>\n<h4><strong>7. Purposes for Which We Collect Personal Data \/ How We Use and Share Your Personal Data \/ Location of Processing<\/strong><\/h4>\n<p>Purposes for Which We Collect Personal Data<\/p>\n<p>We do not sell your Personal Data to third parties to use for their own marketing purposes. Lux Trading Firm uses the information we collect for the following purposes:<\/p>\n<ul>\n<li>Provide our Services. To provide the services we offer on our Sites and Services, to communicate with you about your use of our Sites or Services, to respond to your inquiries, to provide troubleshooting, and for other customer services designed to make your experience better.<\/li>\n<li>Personalization. To tailor the content and information that we may send or display to you, to suggest personalized help and instructions, and to otherwise personalize your experience while visiting or using our Sites or Services.<\/li>\n<li>Advertising. To display interest-based advertising to you, to improve our advertising and measurement systems so that we can show you more relevant ads, and to measure the effectiveness and reach of ads and services.<\/li>\n<li>Marketing and Promotions. For marketing and promotional purposes, such as to send you news and updates, special offers, and promotions, or other otherwise contact you about products, services, or information we think may interest you, including information about third party products and services.<\/li>\n<li>Analytics. To gather metrics to better understand how Users access and use the Sites and Services; to evaluate and improve the Sites and Services; and to develop new products and services.<\/li>\n<li>Comply with the Law. To comply with legal obligations, as part of our general business operations, and for other business administration purposes.<\/li>\n<li>Prevent Misuse. Where we believe it is necessary to investigate, prevent, or take action regarding illegal activities, suspected fraud, situations involving potential threats to the safety of any person, or violations of our Terms of Use or this Privacy Policy.<\/li>\n<\/ul>\n<p>How We Use Your Personal Data<\/p>\n<p>We use the information you provide to offer, manage, or improve our Sites or Services, including but not limited to:<\/p>\n<ul>\n<li>improving content<\/li>\n<li>adapting or adding in new features and functionality<\/li>\n<li>providing and improving service and support<\/li>\n<li>delivering relevant advertising<\/li>\n<li>assisting with social sharing functionality<\/li>\n<li>developing new products and services<\/li>\n<li>selecting content to be communicated to you<\/li>\n<li>aggregating certain types of information to better understand or provide better engagement with our Users; and<\/li>\n<li>contacting you regarding our products or services; and preventing and detecting security threats, fraud or other malicious activity.<\/li>\n<\/ul>\n<p>Lux Trading Firm may share your Personal Data with our affiliates or with third parties, which provide services to us and which agree to keep such Personal Data confidential.<\/p>\n<p>In particular, your data will be automatically shared with our broker AfterPrime, which acts as a processor of the data. AfterPrime is located outside of the EU. You may find its privacy policy at <a href=\"https:\/\/afterprime.com\/privacy\/\">https:\/\/afterprime.com\/privacy\/<\/a><\/p>\n<p>We may employ third-party companies and individuals for any of the following:<\/p>\n<ul>\n<li>to facilitate the Sites or Services<\/li>\n<li>to provide the Sites or Services on our behalf<\/li>\n<li>to perform related services, including maintenance, database management, web analytics, and improvement of the features or functionality<\/li>\n<li>to assist us in data analysis; and<\/li>\n<li>to process debit, credit, and other payments and to perform related services.<\/li>\n<\/ul>\n<p>Lux Trading Firm may collect and compile general information about you, your preferences and interests and use that information as described in this Section. We may share with or sell such information to third parties for these same purposes but would never do so without your consent. When you sign up for an Account, you will be asked if you consent to us sharing or selling your information. If you do not provide your consent, we will not share with or sell any of your information to third parties.<\/p>\n<p>We retain the right to disclose Personal Data as allowed or required by law. We may also disclose Personal Data under the following circumstances:<\/p>\n<ul>\n<li>to respond to duly authorized information requests of police and governmental authorities<\/li>\n<li>to comply with any law, regulation, subpoena, or court order<\/li>\n<li>to investigate and help prevent security threats, fraud or other malicious activity<\/li>\n<li>to investigate and help prevent a violation of any contractual or other relationship with Lux Trading Firm or the perpetration of any illegal or harmful activity;<\/li>\n<li>to enforce and protect the rights and properties of Lux Trading Firm, its affiliates and its business partners; and<\/li>\n<li>to protect the personal safety of our employees, agents, affiliates, business partners, customers or site users.<\/li>\n<\/ul>\n<p>In the event of a merger, consolidation, or sale or transfer of all or substantially all of the assets of Lux Trading Firm or the Lux Trading Firm Parties, Personal Data stored in our database will be transferred to the purchasing or new entity. However, the use of this information by any purchasing or surviving entity would be governed by the terms of this Privacy Policy, as amended from time to time, including any amendment after such transaction.<\/p>\n<p>Your information may be transferred to and maintained on computers and servers located outside of your state, province, country, or other governmental jurisdiction where the privacy laws may not be as protective as those in your jurisdiction. If you are located outside the EU and choose to provide information to us, Lux Trading Firm transfers Personal Data to the EU and processes it there. Your consent to this Privacy Policy followed by your submission of such information represents your agreement to that transfer.<\/p>\n<p>Location of Processing<\/p>\n<p>Personal Data is processed in the EU. Personal Data from USA Users and Brazilian Users is processed in the EU. Lux Trading Firm shall process such Personal Data in accordance with the requirements of the GDPR and LGPD.<\/p>\n<h4><strong>7. California Privacy Rights<\/strong><\/h4>\n<p>This Section supplements the information contained in this Privacy Policy and applies solely to all visitors, users, and others who reside in the State of California. This Section complies with the California Consumer Privacy Act of 2018 (“CCPA”) and any terms defined in the CCPA have the same meaning when used in this Section. This Section does not apply to workforce-related personal information collected from California-based employees, job applicants, contractors or similar individuals.<\/p>\n<p>Our Site or Services collects information that may identify, relate to, describe, reference, or is reasonably capable of being associated with, or could reasonably be linked, directly or indirectly, with a particular consumer, household or device (“Personal Information”). Personal Information does not include:<\/p>\n<ul>\n<li>Publicly available information from government records;<\/li>\n<li>Deidentified or aggregated consumer information; or<\/li>\n<li>Information excluded from the CCPA’s scope.<\/li>\n<\/ul>\n<p>In particular, our Sites or Services has collected the following categories of Personal Information from consumers within the last 12 months:<\/p>\n<figure class=\"wp-block-table\">\n<table>\n<tbody>\n<tr>\n<td><strong>Category<\/strong><\/td>\n<td><strong>Examples<\/strong><\/td>\n<td><strong>Collected<\/strong><\/td>\n<\/tr>\n<tr>\n<td>A. Identifiers<\/td>\n<td>A name, signature, Social Security number, physical characteristics or description, address, telephone number, passport number, driver’s license or state identification card number, insurance policy number, education, employment, employment history, bank account number, credit card number, debit card number, or any other financial information, medical information, or health insurance information. Some personal information included in this category may overlap with other categories.<\/td>\n<td>YES<\/td>\n<\/tr>\n<tr>\n<td>C. Protected classification characteristics under California or Federal Law<\/td>\n<td>Age (40 years or older), race, color, ancestry, national origin, citizenship, religion or creed, marital status, medical condition, physical or mental disability, sex (including gender, gender identity, gender expression, pregnancy or childbirth and related medical conditions), sexual orientation, veteran or military status, genetic information (including familial genetic information).<\/td>\n<td>YES<\/td>\n<\/tr>\n<tr>\n<td>D. Commercial Information<\/td>\n<td>Records of personal property, products or services purchased, obtained, or considered, or other purchasing or consuming histories or tendencies.<\/td>\n<td>NO<\/td>\n<\/tr>\n<tr>\n<td>E. Biometric Information<\/td>\n<td>Genetic, physiological, behavioral, and biological characteristics, or activity patterns used to extract a template or other identifier or identifying information, such as, fingerprints, faceprints, and voiceprints, iris or retina scans, keystroke, gait, or other physical patterns, and sleep, health, or exercise data.<\/td>\n<td>NO<\/td>\n<\/tr>\n<tr>\n<td>F. Internet or another similar network activity<\/td>\n<td>Browsing history, search history, information on a consumer’s interaction with a website, application, or advertisement.<\/td>\n<td>YES<\/td>\n<\/tr>\n<tr>\n<td>G. Geolocation Data<\/td>\n<td>Physical location or movements.<\/td>\n<td>NO<\/td>\n<\/tr>\n<tr>\n<td>H. Sensory Data<\/td>\n<td>Audio, electronic, visual, olfactory, or similar information.<\/td>\n<td>NO<\/td>\n<\/tr>\n<tr>\n<td>I. Professional or employment-related information<\/td>\n<td>Current or past job history or performance evaluations.<\/td>\n<td>NO<\/td>\n<\/tr>\n<tr>\n<td>J. Non-public education information<\/td>\n<td>Education records directly related to a student maintained by an educational institution or party acting on its behalf, such as grades, transcripts, class lists, student schedules, student identification codes, student financial information, or student disciplinary records.<\/td>\n<td>NO<\/td>\n<\/tr>\n<tr>\n<td>K. Inferences drawn from other personal information<\/td>\n<td>Profile reflecting a person’s preferences, characteristics, psychological trends, predispositions, behavior, attitudes, intelligence, abilities, and aptitudes.<\/td>\n<td>NO<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/figure>\n<p>We obtain the categories of Personal Information listed above from the following categories:<\/p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>Directly from you. For example, forms you complete or products and services your purchase; and<\/li>\n<\/ul>\n<ul>\n<li>Indirectly from you. For example, from observing your actions on our Site.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>The CCPA provides California residents with specific rights regarding their Personal Information. California residents have the right to request that we disclose certain information to you about our collection and use of your personal information over the past 12 months (the “right to know”). Once we receive your request and confirm your identity, we will disclose to you:<\/p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>The categories of Personal Information we collected about you.<\/li>\n<\/ul>\n<ul>\n<li>The categories of sources for the Personal Information we collected about you.<\/li>\n<\/ul>\n<ul>\n<li>Our business or commercial purpose for collecting or selling that Personal Information.<\/li>\n<\/ul>\n<ul>\n<li>The categories of third parties with whom we share that personal information.<\/li>\n<\/ul>\n<ul>\n<li>If we sold or disclosed your Personal Information for a business purpose, two separate lists disclosing:<\/li>\n<\/ul>\n<ul>\n<li>sales, identifying the Personal Information categories that each category of recipient purchased; and<\/li>\n<\/ul>\n<ul>\n<li>disclosures of a business purpose, identifying the Personal Information categories that each category of recipient obtained.<\/li>\n<\/ul>\n<ul>\n<li>The specific pieces of Personal Information we collected about you (also called a portability request).<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>California residents also have the right to request that we delete any of your Personal Information that we collected from you and retained, subject to certain exceptions (the “right to delete”). Once we receive your request and confirm your identity, we will review your request to see if an exception allowing us to retain the Personal Information applies. We will delete or deidentify Personal Information not subject to one of these exceptions from our records and will direct our service providers to take similar action.<\/p>\n<p>To exercise your rights to know or delete described above, please submit a request by submitting a request to: c\/o Lux Trading Firm, Only you, or someone legally authorized to act on your behalf, may request to know or delete related to your Personal Information. You may also make a request to know or delete on behalf of your child. You may only submit a request to know within a 12-month period. Your request to know or delete must provide sufficient information that allows us to reasonably verify you are the persona bout whom we collected Personal Information or an authorized representative. We endeavor to substantively respond to a verifiable consumer request within 45 days of its receipt. If we require more time (up to another 45 days), we will inform you of the reason and extension period in writing.<\/p>\n<p>We will not discriminate against you for exercising any of your CCPA rights. However, we may offer you certain financial incentives permitted by the CCPA that can result in different prices, rates, or quality levels. Any CCPA-permitted financial incentive we offer will reasonably relate to your Personal Information’s value.<\/p>\n<p>We will not discriminate against you for exercising any of your CCPA rights. However, we may offer you certain financial incentives permitted by the CCPA that can result in different prices, rates, or quality levels. Any CCPA-permitted financial incentive we offer will reasonably relate to your Personal Information’s value.<\/p>\n<h4><strong>9. GDPR and LGPD<\/strong><\/h4>\n<p>European Union General Data Protection Regulation 2016\/679<\/p>\n<p>European Union General Data Protection Regulation EU 2016\/679 (“GDPR”), approved by the European Parliament on April 14, 2016, and effective May 25, 2018, addresses the protection of natural persons located in the EU with respect to the processing of their Personal Data. GDPR recognizes that Personal Data shall be:<\/p>\n<ul>\n<li>processed lawfully, fairly and in a transparent manner;<\/li>\n<li>collected for specified, explicit, and legitimate purposes and not further processed in a manner that is incompatible with those purposes;<\/li>\n<li>adequate, relevant, and limited to what is necessary for the purposes for which it is processed;<\/li>\n<li>accurate and, where necessary, kept up to date;<\/li>\n<li>kept in a form which permits identification of Data Subjects for no longer than is necessary for the purposes for which the personal data are processed; and<\/li>\n<li>processed in a manner that ensures appropriate security of the personal data, including protection against unauthorized or unlawful processing and against accidental loss, destruction or damage, using appropriate technical or organizational measures.<\/li>\n<\/ul>\n<p>As a Controller, Lux Trading Firm shall be responsible for, and shall be able to demonstrate compliance with, the foregoing principles. Therefore, you have the right:<\/p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>to request the correction or update of any Personal Data that is incorrect or incomplete;<\/li>\n<li>to request the erasure of your Personal Data (the right to be forgotten);<\/li>\n<li>to portability of your Personal Data;<\/li>\n<li>to object to the processing of your Personal Data;<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>li&gt;not to be subject to a decision based on automated decision-making, including profiling;<\/p>\n<ul>\n<li>to withdraw consent to the processing of your Personal Data; and<\/li>\n<li>to register a complaint with an EU supervisory authority.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>LGPD Supplemental Privacy Notice<\/p>\n<p>This Section addresses legal obligations and rights set forth in the LGPD that apply only to eligible residents of Brazil. These obligations and rights apply to businesses doing business in Brazil and to Brazilian residents and information that relates to Brazilian Users. IT does not apply to information that has been anonymized by the LGPD.<\/p>\n<p>If you are a Brazilian resident, the following provisions apply in addition to the terms of the Privacy Notice<\/p>\n<ul>\n<li>The LGPD grants you certain rights about your Personal Data. In addition to the rights outlined in this Privacy Policy, you also have the right to:<\/li>\n<li>request the deletion, blocking or anonymization of your Personal Data, if you believe Lux Trading Firm is processing your Personal Data information in an unnecessary, exceeding or non-compliant matter;<\/li>\n<li>request the portability of your Personal Data; and<\/li>\n<li>request information about the entities with which Lux Trading Firm has shared your Personal Data with.<\/li>\n<li>Because the Services and Sites are provided to you by Lux Trading Firm in the EU, Lux Trading Firm needs to carry out international transfers of your Personal Data from Brazil to the EU and other countries for the proper operation of the Services. Therefore, the international transfers of all Brazilian Users’ Personal Data are based upon contractual necessity, as provided by the LGPD.<\/li>\n<\/ul>\n<p>Request for the deletion of Personal Data &gt;<\/p>\n<p>Under the GDPR and the LGPD, EU Users and Brazilian Users may have the right to request the deletion of their Personal Data that Lux Trading Firm collects, stores, or processes. In the event Lux Trading Firm receives such a request, Lux Trading Firm will erase the Personal Data without undue delay (which will be no longer than 30 days for EU Users and no longer than 15 days for Brazilian Users). All requests will be subject to our information request requirements, including identity verification and authentication procedures, as well as compliance with applicable law. To the extent permitted by the applicable laws, we may decline, however, requests that are unreasonable, incomplete, do not comply with our information request procedures or that are not required to be honored by applicable law.<\/p>\n<h4><strong>9. Keeping Your Personal Data Secure<\/strong><\/h4>\n<p>To prevent unauthorized access or disclosure, to maintain data accuracy, and to ensure the appropriate use of the information, Lux Trading Firm utilizes generally accepted industry standards to protect your Personal Data submitted to Lux Trading Firm or relies on the services of third parties to provide the same. However, no method of transmission over the internet or method of electronic storage is 100% secure. We cannot guarantee the absolute security of your Personal Data.<\/p>\n<h4><strong>11. Children’s Privacy<\/strong><\/h4>\n<p>Lux Trading Firm Sites or Services are not intended for use by minors under the age of 18 and are not targeted to children. Lux Trading Firm does not knowingly collect information from children under the age of 16, solicit information from such children, or market products to such children.<\/p>\n<h4><strong>11. Sensitive Data<\/strong><\/h4>\n<p>We do not intentionally collect, process, transfer, or store Sensitive Data.<\/p>\n<h4><strong>12. Log Data and Cookies<\/strong><\/h4>\n<p>We use cookies and other similar technologies, including log data, on our Sites and Services to distinguish you from other users of our websites and apps (including when you browse third-party websites). This helps us to provide you with a good experience when you use our services. We also use cookies and similar technologies to show you more personalized advertising. You may adjust the settings on your browser to refuse cookies but some of our services may not work if you do so.<\/p>\n<p>Our servers also automatically record Log Data which includes information such as your internet service provider, your computer’s internet protocol address, browser type and operating system, referring\/exit pages, clickstream data, pages of our Sites and Services that you visit (and the time spent on these pages), information you search for on our Sites or Services, and other statistics. We use this information to monitor and analyze your use of our Sites or Services and to better tailor them to your needs in order to provide you with a better experience.<\/p>\n<h4><strong>14. Access to and Accuracy of Your Personal Data<\/strong><\/h4>\n<p>Lux Trading Firm strives to keep your Personal Data accurately recorded. You have the right to access and request the correction, amendment, or deletion of all of your recorded personal information that has been collected by us. If you wish to review your recorded Personal Data, please contact us at:<span> <\/span><a href=\"mailto:info@lux-trading-firm.com\">info@lux-trading-firm.com<\/a><\/p>\n<p>If you write to us, please include your name, email address, and telephone number and let us know what kind of information you would like to see. You may view and copy your information in person, or if you prefer, we will copy and send you your information. If you see any mistakes, let us know and we will review it. If we agree, we will correct our files. If we disagree, you may file a short statement of dispute with us. Your statement will be included with any data we disclose in the future. We will also send the statement to anyone you ask us to who received your information from us in the past two years.<\/p>\n<p><strong>15. Data Retention<\/strong><\/p>\n<p>Lux Trading Firm retains Personal Data for as long as we reasonably require it for legal or business purposes. In determining data retention periods, Lux Trading Firm takes into consideration local laws, contractual obligations, and the expectations and requirements of our Users. We will not retain data longer than is necessary to fulfill the purposes for which it was collected or as required by applicable laws or regulations. When we no longer need personal information, we securely delete or destroy it.<\/p>\n<h4><strong>16. Acceptance of and Modifications to This Privacy Policy<\/strong><\/h4>\n<p>You must affirm that you have read, understand, and accept the terms of this Privacy Policy. If you do not accept the terms of this Privacy Policy, you must discontinue your use of the Sites and Services.<\/p>\n<p>The terms of the Privacy Policy may change from time to time. If we modify our Privacy Policy, we will notify you and post the revised statement here, with an updated revision date. You must affirm that you have read, understand, and accept the revised terms of this Privacy Policy. If you do not accept the revised terms of this Privacy Policy, you must discontinue your use of the Sites and Services.<\/p>\n<h4><strong>17. Contact Us<\/strong><\/h4>\n<p>We value your opinion. If you have comments or questions about our Privacy Policy, please send them to our Data Protection Officer at <a href=\"mailto:info@lux-trading-firm.com\">info@lux-trading-firm.com<\/a><span> <\/span>[\/vc_column_text][\/vc_column_inner][\/vc_row_inner][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; crypterium_vc_row_jarallax=&#8221;yes&#8221; el_id=&#8221;intro&#8221; p_img=&#8221;2015&#8243; crypterium_vc_row_jarallax_speed=&#8221;0.3&#8243;][vc_column][\/vc_column][\/vc_row][vc_row full_width=&#8221;stretch_row&#8221; crypterium_vc_row_overflow=&#8221;hidden&#8221; css=&#8221;.vc_custom_1608118807347{padding-top: 100px !important;padding-bottom: 50px !important;}&#8221;][vc_column][vc_row_inner][vc_column_inner][vc_column_text css=&#8221;.vc_custom_1680515307063{margin-bottom: 60px !important;}&#8221;] 1. Scope of This Privacy Policy This Privacy Policy outlines what types of information are collected from our account holders, users, and visitors(“you”, “your” or “User”), to whom it may be disclosed, and how that information may be used&#8230;<\/p>\n","protected":false},"author":198174107,"featured_media":29175,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"custom-page.php","meta":{"_coblocks_attr":"","_coblocks_dimensions":"","_coblocks_responsive_height":"","_coblocks_accordion_ie_support":"","_mo_disable_npp":"","_starter_page_template":""},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v20.5 (Yoast SEO v20.5) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Privacy Policy | Lux Trading Firm<\/title>\n<meta name=\"description\" content=\"This Privacy Policy outlines what types of information are collected from our account holders, users, and visitors. By using the Sites or Services, you agree that you have read, understood.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/luxtradingfirm.com\/privacy-policy-2\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Privacy Policy\" \/>\n<meta property=\"og:description\" content=\"1. Scope of This Privacy Policy This Privacy Policy outlines what types of information are collected from our account holders, users, and visitors(“you”,\" \/>\n<meta property=\"og:url\" content=\"https:\/\/luxtradingfirm.com\/privacy-policy-2\/\" \/>\n<meta property=\"og:site_name\" content=\"Lux Trading Firm\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/\" \/>\n<meta property=\"article:modified_time\" content=\"2023-04-03T09:48:44+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/luxtradingfirm.com\/wp-content\/uploads\/2023\/03\/13.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1000\" \/>\n\t<meta property=\"og:image:height\" content=\"750\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@FirmLux\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"21 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/luxtradingfirm.com\/privacy-policy-2\/\",\"url\":\"https:\/\/luxtradingfirm.com\/privacy-policy-2\/\",\"name\":\"Privacy Policy | Lux Trading Firm\",\"isPartOf\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#website\"},\"datePublished\":\"2020-12-16T11:44:25+00:00\",\"dateModified\":\"2023-04-03T09:48:44+00:00\",\"description\":\"This Privacy Policy outlines what types of information are collected from our account holders, users, and visitors. By using the Sites or Services, you agree that you have read, understood.\",\"breadcrumb\":{\"@id\":\"https:\/\/luxtradingfirm.com\/privacy-policy-2\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/luxtradingfirm.com\/privacy-policy-2\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/luxtradingfirm.com\/privacy-policy-2\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/luxtradingfirm.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Privacy Policy\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/luxtradingfirm.com\/#website\",\"url\":\"https:\/\/luxtradingfirm.com\/\",\"name\":\"Lux Trading Firm\",\"description\":\"Funded Forex Trading Program\",\"publisher\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/luxtradingfirm.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/luxtradingfirm.com\/#organization\",\"name\":\"Lux Trading Firm\",\"url\":\"https:\/\/luxtradingfirm.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1\",\"width\":3400,\"height\":1104,\"caption\":\"Lux Trading Firm\"},\"image\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/\",\"https:\/\/twitter.com\/FirmLux\",\"https:\/\/www.instagram.com\/luxtradingfirm\/\",\"https:\/\/www.youtube.com\/channel\/UCZydph7k_5BXAgHIedXPoKg\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Privacy Policy | Lux Trading Firm","description":"This Privacy Policy outlines what types of information are collected from our account holders, users, and visitors. By using the Sites or Services, you agree that you have read, understood.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/luxtradingfirm.com\/privacy-policy-2\/","og_locale":"en_US","og_type":"article","og_title":"Privacy Policy","og_description":"1. Scope of This Privacy Policy This Privacy Policy outlines what types of information are collected from our account holders, users, and visitors(“you”,","og_url":"https:\/\/luxtradingfirm.com\/privacy-policy-2\/","og_site_name":"Lux Trading Firm","article_publisher":"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/","article_modified_time":"2023-04-03T09:48:44+00:00","og_image":[{"width":1000,"height":750,"url":"https:\/\/luxtradingfirm.com\/wp-content\/uploads\/2023\/03\/13.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_site":"@FirmLux","twitter_misc":{"Est. reading time":"21 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/luxtradingfirm.com\/privacy-policy-2\/","url":"https:\/\/luxtradingfirm.com\/privacy-policy-2\/","name":"Privacy Policy | Lux Trading Firm","isPartOf":{"@id":"https:\/\/luxtradingfirm.com\/#website"},"datePublished":"2020-12-16T11:44:25+00:00","dateModified":"2023-04-03T09:48:44+00:00","description":"This Privacy Policy outlines what types of information are collected from our account holders, users, and visitors. By using the Sites or Services, you agree that you have read, understood.","breadcrumb":{"@id":"https:\/\/luxtradingfirm.com\/privacy-policy-2\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/luxtradingfirm.com\/privacy-policy-2\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/luxtradingfirm.com\/privacy-policy-2\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/luxtradingfirm.com\/"},{"@type":"ListItem","position":2,"name":"Privacy Policy"}]},{"@type":"WebSite","@id":"https:\/\/luxtradingfirm.com\/#website","url":"https:\/\/luxtradingfirm.com\/","name":"Lux Trading Firm","description":"Funded Forex Trading Program","publisher":{"@id":"https:\/\/luxtradingfirm.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/luxtradingfirm.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/luxtradingfirm.com\/#organization","name":"Lux Trading Firm","url":"https:\/\/luxtradingfirm.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/","url":"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1","contentUrl":"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1","width":3400,"height":1104,"caption":"Lux Trading Firm"},"image":{"@id":"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/","https:\/\/twitter.com\/FirmLux","https:\/\/www.instagram.com\/luxtradingfirm\/","https:\/\/www.youtube.com\/channel\/UCZydph7k_5BXAgHIedXPoKg"]}]}},"jetpack_shortlink":"https:\/\/wp.me\/PcDwIy-sK","amp_enabled":true,"_links":{"self":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages\/1782"}],"collection":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/users\/198174107"}],"replies":[{"embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/comments?post=1782"}],"version-history":[{"count":6,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages\/1782\/revisions"}],"predecessor-version":[{"id":30651,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages\/1782\/revisions\/30651"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/media\/29175"}],"wp:attachment":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/media?parent=1782"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}