{"id":29318,"date":"2023-03-21T07:54:59","date_gmt":"2023-03-21T07:54:59","guid":{"rendered":"https:\/\/luxtradingfirm.com\/?page_id=29318"},"modified":"2023-03-21T08:05:46","modified_gmt":"2023-03-21T08:05:46","slug":"term-of-affiliate","status":"publish","type":"page","link":"https:\/\/luxtradingfirm.com\/term-of-affiliate\/","title":{"rendered":"Terms of Affiliate"},"content":{"rendered":"<p>[vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; crypterium_vc_row_jarallax=&#8221;yes&#8221; el_id=&#8221;intro&#8221; p_img=&#8221;5497&#8243; crypterium_vc_row_jarallax_speed=&#8221;0.3&#8243;][vc_column]<div class=\"section-heading   col-MB- section-heading--center \" ><h1 class=\"__title\">Terms of Affiliate<\/h1><\/div>[\/vc_column][\/vc_row][vc_section css=&#8221;.vc_custom_1618201069905{padding-top: 70px !important;padding-bottom: 70px !important;}&#8221;][vc_row][vc_column][vc_custom_heading text=&#8221;1. GENERAL PROVISIONS&#8221; font_container=&#8221;tag:h4|text_align:left&#8221; use_theme_fonts=&#8221;yes&#8221; el_class=&#8221;aff-term-h&#8221;][vc_column_text el_class=&#8221;term-aff-p&#8221;]These Terms and Conditions of Affiliate Program Use (hereinafter also as &#8220;Terms and Conditions&#8221;) govern the legal relationship between the Participant of this Program (hereinafter also as &#8220;Affiliate&#8221;) and Lux Trading Firm s.r.o, registered office at Dunajska 8, SK-811 08, Bratislava, ICO 52927466 registered at the Commercial Register kept by the Municipal Court in Bratislava I, section: Sro, file nr. 151196\/B (hereinafter also as the &#8220;Provider&#8221;), as the Provider of the Affiliate Program.[\/vc_column_text][vc_custom_heading text=&#8221;2. DEFINITION AND INTERPRETATION OF TERMS&#8221; font_container=&#8221;tag:h4|text_align:left&#8221; use_theme_fonts=&#8221;yes&#8221; el_class=&#8221;aff-term-h&#8221;][vc_column_text el_class=&#8221;term-aff-p&#8221;]<b>HTML code<\/b> is a special unique software code, assigned to the Affiliate by the Provider, which, after it is inserted in the Website, displays as Advertising Area;<br \/>\n<b>A visitor<\/b> is a person who is not the Provider or the Affiliate and who visits the Website;<br \/>\n<b>Reward to the Affiliate<\/b> is the reward which the Provider undertakes to pay the Affiliate for the fulfillment of the conditions stated in Article 5 of these Terms and Conditions;<br \/>\n<b>An affiliate<\/b> is a natural person or a legal person who concludes the contract with the Provider;<br \/>\n<b>Terms and Conditions <\/b>are as a term defined in Article 1 above;<br \/>\n<b>The provider<\/b> is as a term defined in Article 1 above;<br \/>\n<b>Advertising Area<\/b> is advertising space displayed on the Website with HTML code which contains a promotional message regarding the services offered by the Provider and a functional link leading to the website <a href=\"luxtradingfirm.com\">luxtradingfirm.com<\/a>;<br \/>\n<b>A contract<\/b> is a contract on commercial cooperation between the Affiliate and the Provider, the content of which is comprised in these Terms and Conditions;<br \/>\n<b>Contract on Analytical Services<\/b> is a Contract on the provision of a Demo Account in the extend of individual variants offered by the Provider concluded between the Provider and the Visitor, the General Terms and Conditions of which are available at <a href=\"https:\/\/luxtradingfirm\/terms-of-use\/\">https:\/\/luxtradingfirm\/terms-of-use\/<\/a>;<br \/>\n<b>The Website<\/b> is the Website to which the Affiliate has a legal relationship and on which the HTML code is placed;<br \/>\n<b>Customer Account<\/b> is a customer account of the Affiliate at luxtradingfirm.com; and<br \/>\n<b>Luxtradingfirm.com<\/b> is the website <a href=\"www.luxtradingfirm.com\">www.luxtradingfirm.com<\/a>, operated by the Provider.<br \/>\n[\/vc_column_text][vc_custom_heading text=&#8221;3. REGISTRATION AND CONTRACT CONCLUSION&#8221; font_container=&#8221;tag:h4|text_align:left&#8221; use_theme_fonts=&#8221;yes&#8221; el_class=&#8221;aff-term-h&#8221;][vc_column_text el_class=&#8221;term-aff-p&#8221;]Before concluding the contract, the Affiliate registers on <a href=\"https:\/\/luxtradingfirm.com\/affiliate\/\">https:\/\/luxtradingfirm.com\/affiliate\/<\/a> by completing and submitting the registration form to the Provider, expressing their consent to be bound by the Terms and Conditions. Upon registration, the Affiliate receives an email from the Provider confirming the registration, with reference to his or her Customer Account. The Affiliate undertakes to keep all information about him or herself in his or her Customer Account up to date for the entire duration of the Contract.<br \/>\nBefore concluding the Contract, the Affiliate has the right to have the Website examined. The contract is concluded when the e-box of the Affiliate which the Affiliate had stated the address of at registration receives a confirmation e-mail message stating that the Provider accepts the conclusion of the Contract. The content of the Contract is comprised of these Terms and Conditions.<br \/>\n[\/vc_column_text][vc_custom_heading text=&#8221;4. OBLIGATIONS OF THE AFFILIATE&#8221; font_container=&#8221;tag:h4|text_align:left&#8221; use_theme_fonts=&#8221;yes&#8221; el_class=&#8221;aff-term-h&#8221;][vc_column_text el_class=&#8221;term-aff-p&#8221;]4.1 The Affiliate declares that he or she has carefully read these Terms and Conditions and that he or she is eligible to conclude and fulfill the obligations of this Contract. The Affiliate further undertakes to and declares that:<br \/>\na) he or she is not an employee of the Provider;<br \/>\nb) the Website is not created solely for the purpose of displaying advertisement;<br \/>\nc) the purpose of the Website is not the dissemination of content that is (I) in violation of the legal order or principles of morality, or (II) xenophobic, racist, pornographic, cruel or abusive;<br \/>\nd) the Website has the character of a finished web page, standard appearance and does not summon doubts as to the trustworthiness of its content;<br \/>\ne) the location of the Advertising Area on the Website will not lead to the diminishing of the Provider&#8217;s reputation or any other injury to the Provider;<br \/>\nf) he or she shall not modify the Advertising Area or the HTML code;<br \/>\ng) he or she shall place the Advertising Area only on the Website he or she had stated at registration;<br \/>\nh) he or she shall not send out emails or act on behalf of the Provider or give such impression;<br \/>\ni) he or she shall not violate trademarks or reputation of the Provider; and<br \/>\nj) he or she shall not transfer or sign over his or her obligations arising from the Contract without the prior written consent of the Provider.<br \/>\n4.2 At registration, the Affiliate shall state, inter alia, the URL of the Website(s). Throughout the Contract duration, the Affiliate is entitled to propose another Website via his or her Customer Account. The Website, as well as the proposal of another Website on the part of the Affiliate, is subjected to the approval of the Provider. At any time throughout Contract duration, the Provider is entitled to decide that the Affiliate must not place the Advertising Area at any of the proposed Websites. In the event that the Provider notifies the Affiliate stating that he or she must not place the Advertising Area at a proposed Website, the Provider is also entitled to terminate the Contract without notice period.<br \/>\n4.3 After the conclusion of the Contract, the Affiliate shall obtain an HTML code from the Provider. The Affiliate undertakes to put the HTML code on his or her Website and verify that by placing HTML code on the Website, the Advertising Area including a functional link to luxtradingfirm.com was established.<br \/>\n4.4 Only one Advertising Area (including its shifts in any direction) may be placed at any given sub-page of the Website.<br \/>\n4.5 When inserting the Advertising Area, it is forbidden to use automatic redirection to another page, automatic opening of new browser tabs (so-called auto-hit systems, pop-up, pop-under), or loading the Provider&#8217;s pages into the so-called I-frame.<br \/>\n4.6 Immediately after placing the Advertising Area on the Website, the Affiliate undertakes to send the Provider a link to all the sub-pages of the Website where the Advertising Area is placed. The Affiliate shall notify the Provider of any change to the placement of the Advertising Area on the Website within 72 hours of such change.<br \/>\n[\/vc_column_text][vc_custom_heading text=&#8221;5. REWARD TO THE AFFILIATE&#8221; font_container=&#8221;tag:h4|text_align:left&#8221; use_theme_fonts=&#8221;yes&#8221; el_class=&#8221;aff-term-h&#8221;][vc_column_text el_class=&#8221;term-aff-p&#8221;]5.1 The right to Reward to the Affiliate arises upon the fulfillment of the following conditions:<br \/>\na) the Visitor has clicked on the link positioned in the Advertising Area which redirected the Visitor to <a href=\"https:\/\/luxtradingfirm.com\/\">https:\/\/luxtradingfirm.com\/<\/a>, and<br \/>\nb) the Visitor concluded a Contract on Analytical Services within one month of the first access to <a href=\"https:\/\/luxtradingfirm.com\/\">https:\/\/luxtradingfirm.com\/<\/a>via the link that is located in the Advertising Area, and<br \/>\nc) the Contract on Analytical Services with the Visitor is not terminated within 14 days of its conclusion.<br \/>\nd) the Visitor is not The Affiliate. (No affiliate commission on own purchases)<br \/>\ne) the Affiliate has had at least 5 eligible referrals.<br \/>\n5.2 To avoid doubt, it is stipulated that the Affiliate is not entitled to Reward for the sole placement of the Advertising Area on the Website.<br \/>\n5.3 The Affiliate&#8217;s right to the payment of the Reward to the Affiliate in the amount and on the basis of analytical measurements by the Provider arises in the following amounts:<br \/>\na) 12.5% of the price of the respective variant according to the Contract on Analytical Services if concluded with a Visitor who in the past has not concluded a Contract on Analytical Services.<br \/>\n5.4 In the event that the Affiliate is an entrepreneur, the Reward to the Affiliate will be paid by the Provider in the form of monetary settlement. In the event that an Affiliate is a non-entrepreneurial person, the Reward to the Affiliate will be paid in the form of discounts on the services provided by the Provider of the Affiliate&#8217;s choice.<br \/>\n5.5 The Provider shall notify the Affiliate of the amount of the Reward to the Affiliate for the preceding month to the email the Affiliate as listed in the Customer Account.<br \/>\n5.6 The Provider shall pay the Reward to the Affiliate who is an entrepreneur within 30 days of receipt of the notice of the amount of Reward to the Affiliate reached cashless to the account of the Affiliate, on the basis of an invoice which the Affiliate issues if the amount of the Reward to Affiliate exceeds the sum of at least USD 50 in the respective month. The Reward to the Affiliate which has not been charged within 12 months from the date on which it was first possible to be charged with the Provider shall be statute-barred. The Reward to the Affiliate shall be deemed paid upon its debiting from the Provider&#8217;s bank account in favor of the bank account of the Affiliate.<br \/>\n5.7 An Affiliate who is an entrepreneur is entitled to increase the amount of the Reward to the Affiliate by the value-added tax in the amount according to the effective legislation if the payment is subject to this tax.[\/vc_column_text][vc_custom_heading text=&#8221;6. CONTRACT DURATION OF CONTRACT AND TERMINATION&#8221; font_container=&#8221;tag:h4|text_align:left&#8221; use_theme_fonts=&#8221;yes&#8221; el_class=&#8221;aff-term-h&#8221;][vc_column_text el_class=&#8221;term-aff-p&#8221;]6.1 This Contract is concluded for an indefinite period.<br \/>\n6.2 Both the Provider and the Affiliate are entitled to withdraw from the Contract with a one-month notice period which starts running on the first day of the month following the month when the notification was delivered to the other Contracting Party.<br \/>\n6.3 The Provider is entitled to terminate the Contract without notice if the Affiliate breaches any of the obligations contained in article 4.1 hereof.<br \/>\n6.4 After the termination of this Contract, the Affiliate undertakes to promptly remove the Advertising Area from the Website.<br \/>\n[\/vc_column_text][vc_custom_heading text=&#8221;7. GENERAL PROVISIONS&#8221; font_container=&#8221;tag:h4|text_align:left&#8221; use_theme_fonts=&#8221;yes&#8221; el_class=&#8221;aff-term-h&#8221;][vc_column_text el_class=&#8221;term-aff-p&#8221;]7.1 The Affiliate and the Provider undertake that neither of them shall disclose confidential information obtained in the performance of the Contract from the other Party to any third party, in particular data on the Reward of the Provider and the number of Contracts on Analytical Services concluded deriving from them.<br \/>\n7.2 In the event that any provision of these Terms and Conditions becomes invalid or ineffective for any reason, this fact does not cause the invalidity or ineffectiveness of the rest of the Terms and Conditions.<br \/>\n7.3 The Provider reserves the right to change the content of these Terms and Conditions. The updated version of the Terms and Conditions will always be published on <a href=\"https:\/\/luxtradingfirm.com\/affiliate\/\">https:\/\/luxtradingfirm.com\/affiliate\/ <\/a>and the information on the updated version along with the updated Terms and Conditions will be sent to the Affiliate&#8217;s e-mail address. The Affiliate has the right to refuse the changes to the Terms and Conditions and for this reason, to terminate the Contract within the notice period of 3 working days from the date he or she was notified of the changes to the Terms and Conditions. In the event of a conflict in the Terms and Conditions, the Terms and Conditions published under the link listed in this Article of the Terms and Conditions shall be deemed valid and binding.<br \/>\n7.4 These Terms and Conditions and the Contract shall be governed by the law of the Slovak Republic.<br \/>\n7.5 The supervisory authority for compliance with the obligations provided for consumer protection is the National Council of the Slovak Republic, residing at Namestie Alexandra Dubceka 4809, SK-811 01 Stare Mesto, website: <a href=\"https:\/\/www.nrsr.sk\/web\/Default.aspx?Lang=en\" rel=\"nofollow\">https:\/\/www.nrsr.sk\/web\/Default.aspx?Lang=en<\/a>, which is also authorized for extra-judicial resolution of disputes.<br \/>\n7.6 These Terms and Conditions enter into force on February 2020.<br \/>\n[\/vc_column_text][\/vc_column][\/vc_row][\/vc_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; crypterium_vc_row_jarallax=&#8221;yes&#8221; el_id=&#8221;intro&#8221; p_img=&#8221;5497&#8243; crypterium_vc_row_jarallax_speed=&#8221;0.3&#8243;][vc_column][\/vc_column][\/vc_row][vc_section css=&#8221;.vc_custom_1618201069905{padding-top: 70px !important;padding-bottom: 70px !important;}&#8221;][vc_row][vc_column][vc_custom_heading text=&#8221;1. GENERAL PROVISIONS&#8221; font_container=&#8221;tag:h4|text_align:left&#8221; use_theme_fonts=&#8221;yes&#8221; el_class=&#8221;aff-term-h&#8221;][vc_column_text el_class=&#8221;term-aff-p&#8221;]These Terms and Conditions of Affiliate Program Use (hereinafter also as &#8220;Terms and Conditions&#8221;) govern the legal relationship between the Participant of this Program (hereinafter also as &#8220;Affiliate&#8221;) and Lux Trading Firm s.r.o, registered office at Dunajska 8,&#8230;<\/p>\n","protected":false},"author":198174106,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"vc_templates\/full-width-template.php","meta":{"_coblocks_attr":"","_coblocks_dimensions":"","_coblocks_responsive_height":"","_coblocks_accordion_ie_support":"","_mo_disable_npp":"","_starter_page_template":""},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v20.5 (Yoast SEO v20.5) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms of Affiliate - Lux Trading Firm<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/luxtradingfirm.com\/term-of-affiliate\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms of Affiliate\" \/>\n<meta property=\"og:description\" content=\"These Terms and Conditions of Affiliate Program Use (hereinafter also as &quot;Terms and Conditions&quot;) govern the legal relationship between the Participant of\" \/>\n<meta property=\"og:url\" content=\"https:\/\/luxtradingfirm.com\/term-of-affiliate\/\" \/>\n<meta property=\"og:site_name\" content=\"Lux Trading Firm\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/\" \/>\n<meta property=\"article:modified_time\" content=\"2023-03-21T08:05:46+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/Capture2-1-1024x733.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"733\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@FirmLux\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/luxtradingfirm.com\/term-of-affiliate\/\",\"url\":\"https:\/\/luxtradingfirm.com\/term-of-affiliate\/\",\"name\":\"Terms of Affiliate - Lux Trading Firm\",\"isPartOf\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#website\"},\"datePublished\":\"2023-03-21T07:54:59+00:00\",\"dateModified\":\"2023-03-21T08:05:46+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/luxtradingfirm.com\/term-of-affiliate\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/luxtradingfirm.com\/term-of-affiliate\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/luxtradingfirm.com\/term-of-affiliate\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/luxtradingfirm.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Terms of Affiliate\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/luxtradingfirm.com\/#website\",\"url\":\"https:\/\/luxtradingfirm.com\/\",\"name\":\"Lux Trading Firm\",\"description\":\"Funded Forex Trading Program\",\"publisher\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/luxtradingfirm.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/luxtradingfirm.com\/#organization\",\"name\":\"Lux Trading Firm\",\"url\":\"https:\/\/luxtradingfirm.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1\",\"width\":3400,\"height\":1104,\"caption\":\"Lux Trading Firm\"},\"image\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/\",\"https:\/\/twitter.com\/FirmLux\",\"https:\/\/www.instagram.com\/luxtradingfirm\/\",\"https:\/\/www.youtube.com\/channel\/UCZydph7k_5BXAgHIedXPoKg\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Terms of Affiliate - Lux Trading Firm","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/luxtradingfirm.com\/term-of-affiliate\/","og_locale":"en_US","og_type":"article","og_title":"Terms of Affiliate","og_description":"These Terms and Conditions of Affiliate Program Use (hereinafter also as \"Terms and Conditions\") govern the legal relationship between the Participant of","og_url":"https:\/\/luxtradingfirm.com\/term-of-affiliate\/","og_site_name":"Lux Trading Firm","article_publisher":"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/","article_modified_time":"2023-03-21T08:05:46+00:00","og_image":[{"width":1024,"height":733,"url":"https:\/\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/Capture2-1-1024x733.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_site":"@FirmLux","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/luxtradingfirm.com\/term-of-affiliate\/","url":"https:\/\/luxtradingfirm.com\/term-of-affiliate\/","name":"Terms of Affiliate - Lux Trading Firm","isPartOf":{"@id":"https:\/\/luxtradingfirm.com\/#website"},"datePublished":"2023-03-21T07:54:59+00:00","dateModified":"2023-03-21T08:05:46+00:00","breadcrumb":{"@id":"https:\/\/luxtradingfirm.com\/term-of-affiliate\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/luxtradingfirm.com\/term-of-affiliate\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/luxtradingfirm.com\/term-of-affiliate\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/luxtradingfirm.com\/"},{"@type":"ListItem","position":2,"name":"Terms of Affiliate"}]},{"@type":"WebSite","@id":"https:\/\/luxtradingfirm.com\/#website","url":"https:\/\/luxtradingfirm.com\/","name":"Lux Trading Firm","description":"Funded Forex Trading Program","publisher":{"@id":"https:\/\/luxtradingfirm.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/luxtradingfirm.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/luxtradingfirm.com\/#organization","name":"Lux Trading Firm","url":"https:\/\/luxtradingfirm.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/","url":"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1","contentUrl":"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1","width":3400,"height":1104,"caption":"Lux Trading Firm"},"image":{"@id":"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/","https:\/\/twitter.com\/FirmLux","https:\/\/www.instagram.com\/luxtradingfirm\/","https:\/\/www.youtube.com\/channel\/UCZydph7k_5BXAgHIedXPoKg"]}]}},"jetpack_shortlink":"https:\/\/wp.me\/PcDwIy-7CS","amp_enabled":true,"_links":{"self":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages\/29318"}],"collection":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/users\/198174106"}],"replies":[{"embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/comments?post=29318"}],"version-history":[{"count":4,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages\/29318\/revisions"}],"predecessor-version":[{"id":29324,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages\/29318\/revisions\/29324"}],"wp:attachment":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/media?parent=29318"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}