{"id":9398,"date":"2021-09-13T22:32:17","date_gmt":"2021-09-13T21:32:17","guid":{"rendered":"https:\/\/luxtradingfirm.com\/?page_id=9398"},"modified":"2022-12-26T11:41:49","modified_gmt":"2022-12-26T11:41:49","slug":"t_c","status":"publish","type":"page","link":"https:\/\/luxtradingfirm.com\/t_c\/","title":{"rendered":"Terms &#038; Conditions"},"content":{"rendered":"\r\n<div class=\"design-element element-size-box has-rich-content user-selectable-element clickable-element has-rich-content has-text is-section-child\" id=\"id1533558420113\" data-element-id=\"id1533558420113\">\r\n<div class=\"element-main-box design-element-main-box has-rich-content user-selectable-element clickable-element has-rich-content has-text\" data-element-id=\"id1533558420113\">\r\n<div class=\"element-border-box element-border-target element-padding-box design-element-border-box has-rich-content user-selectable-element clickable-element has-rich-content has-text\" data-element-id=\"id1533558420113\">\r\n<div class=\"element-content-box design-element-content-box has-rich-content user-selectable-element clickable-element has-rich-content has-text\" data-element-id=\"id1533558420113\">\r\n<div class=\"content-container content-container-type element-size-box element-size-target has-rich-content user-selectable-element clickable-element has-rich-content has-text\" data-element-id=\"id1533558420113\">\r\n<div class=\"rich-text-element-content absolute-fill element-content dir-ltr\">\r\n<div class=\"rich-text-positioning-wrapper vertical-alignment-top\">\r\n<div class=\"rich-text-content common-rich-content-style has-content\">\r\n<div data-line-height=\"1.4\">\r\n<div>\r\n<p>[vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; crypterium_vc_row_jarallax=&#8221;yes&#8221; el_id=&#8221;intro&#8221; p_img=&#8221;2015&#8243; crypterium_vc_row_jarallax_speed=&#8221;0.3&#8243;][vc_column]<div class=\"section-heading   col-MB- section-heading--center \" ><h1 class=\"__title\">Terms and Conditions<\/h1><\/div>[\/vc_column][\/vc_row][vc_row full_width=&#8221;stretch_row&#8221; crypterium_vc_row_overflow=&#8221;hidden&#8221; css=&#8221;.vc_custom_1608118807347{padding-top: 100px !important;padding-bottom: 50px !important;}&#8221;][vc_column]<div class=\"section-heading   col-MB-35 text--left \" ><h2 class=\"__title\">Last Modified: August 14, 2022<\/h2><\/div>[vc_row_inner][vc_column_inner][vc_column_text css=&#8221;.vc_custom_1608119619617{margin-bottom: 60px !important;}&#8221;]<\/p>\r\n<\/div>\r\n<div>\r\n<p>&nbsp;<\/p>\r\n<p>Lux Trading Firm is a trading name of Lux Trading Firm, a UK limited company.<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Introduction<\/strong><\/p>\r\n<p>These are our General Terms and Conditions. These General Terms and Conditions apply to all our services and websites. Please read them carefully. We also recommend that you check this page often for any changes to our general Terms and Conditions<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Article 1: Identity of the company <\/strong><\/p>\r\n<p>&nbsp;<\/p>\r\n<p>The name of the company is Lux Trading Firm, operating under the trading name Lux Trading Firm. It is based in the UK, with its principal place of business at 160 City Road, London EC1V 2NX, United Kingdom, and with company registration number 13160991.<\/p>\r\n<p>Lux Trading Firm exclusively offers the following services: Trading Evaluation, Trading Education, and Prop Trading.<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Article 2. Definitions<\/strong><\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>2.1 <\/strong>Website: the Websites of Lux Trading Firm to be found on <u>luxtradingfirm.com, <\/u>and all of its subdomains. Additional information about the Lux elite trading packages can be found at luxtradingfirm.com.<\/p>\r\n<p><strong>2.2 <\/strong>Client: the natural person or corporation who enters into an agreement with Lux Trading Firm, and\/or is registered on, or through, the Website.<\/p>\r\n<p><strong>2.3 <\/strong>Agreement: any arrangement or agreement between Lux Trading Firm and the Client of which the General Terms and Conditions are an integral part.<\/p>\r\n<p><strong>2.4 <\/strong>General Terms and Conditions: the General Terms and Conditions are to be applied to all the services and products Lux Trading Firm offers.<\/p>\r\n<p><strong>2.5 <\/strong>Specific Terms and Conditions: those specific Terms and Conditions are to be applied exclusively for one of the products or services Lux Trading Firm offers.<\/p>\r\n<p><strong>2.6 <\/strong>Services: all the services provided on any of our websites.<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Article 3. Applicability of the General and Specific Terms and Conditions<\/strong><\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>3.1.<\/strong> The General Terms and Conditions apply to all offers, agreements, and deliveries of Lux Trading Firm unless explicitly agreed otherwise in writing.<\/p>\r\n<p><strong>3.2<\/strong> The specific terms and conditions apply specifically to the offer, agreement, and deliveries that it is intended to.<\/p>\r\n<p><strong>3.3<\/strong> Deviations from these Terms and Conditions is possible only by means of written confirmation by Lux Trading Firm<\/p>\r\n<p><strong>3.4<\/strong> Any written contract\/agreement between user(s) and Lux Trading Firm will prevail over these Terms and Conditions. In the case of conflict between any separate written agreement between the parties and these Terms and Conditions, the former will prevail.<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Article 4. Specific Terms and Conditions of luxtradingfirm.com<\/strong><\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Article 4.1 Definitions<\/strong><\/p>\r\n<p><strong>4.1.1<\/strong> Application Form: the form on the website of luxtradingfim.com through which a Client may submit to apply for a trading account for trading evaluation.<\/p>\r\n<p><strong>4.1.2<\/strong> Evaluation: the (ongoing) process of evaluating a Client’s compliance with the applicable requirements, as defined in the rules of trading, and in these Terms and Conditions.<\/p>\r\n<p><strong>4.1.3<\/strong> Evaluation Fee: the (one-time) fee which a Client is required to pay for (ongoing) Evaluation, as defined in the rules of trading, and in these Terms and Conditions.<\/p>\r\n<p><strong>4.1.4<\/strong> Client: the natural person or corporation who enters into an agreement with Lux Trading Firm for Trading Evaluation<\/p>\r\n<p><strong>4.1.5<\/strong> Review system: means either, or both, the technology used by Lux Trading Firm to evaluate the Client’s compliance with the applicable requirements, and the manual processes employed to the same end.<\/p>\r\n<p><strong>4.2 Registration and Delivery of Services<\/strong><\/p>\r\n<p><strong>4.2.1 <\/strong>To make optimum use of the Evaluation service, the Client is granted access to a trading platform of his choice, chosen from the available ones, and to a personal Dashboard to monitor his or her progress.<\/p>\r\n<p><strong>4.2.2 <\/strong>The Client will be provided with usernames and passwords with which he can log on to the chosen platform and his or her Dashboard.<\/p>\r\n<p><strong>4.2.3 <\/strong>The Client must keep his login credentials, username, and password strictly confidential. Lux Trading Firm cannot be held liable for any misuse of the login credentials and is always entitled to assume that the Client who logs on to the platform and dashboard, is the party that it professes to be. The Client is responsible for and bears the full risk of any and all actions and transactions performed via the Client’s account.<\/p>\r\n<p><strong>4.2.4<\/strong>. If the Client knows or has reason to suspect that its login details have become available to unauthorized parties, it will be required to change its password as soon as possible and\/or to notify Lux Trading Firm accordingly, to allow Lux Trading Firm to take appropriate measures.<\/p>\r\n<p> <br \/><strong>Article 4.3 Registration process<\/strong><\/p>\r\n<p><strong>4.3.1<\/strong>. To use our services, you first need to register. You must not provide any false or inaccurate information, whether during the registration process or otherwise. After completing registration and payment, you will receive your login credentials via email, to the email address you used when checking out.<\/p>\r\n<p><strong>4.3.2 <\/strong>You must secure access to your account using the username and password against third parties. In particular, you must keep the password strictly confidential. Lux Trading Firm may assume that all actions undertaken from your account after logging in with your username and password is authorized and supervised by you. This means you are liable for these actions, unless and until you have notified Lux Trading Firm that someone else knows your password.<\/p>\r\n<p><strong>4.3.3 <\/strong>Registration and payment are indispensable requisites in order to use our services. Trial account services do not require payment.<\/p>\r\n<p><strong>4.3.4 <\/strong>Lux Trading Firm will process your personal data according to its Privacy Policy, which can be found at <a href=\"https:\/\/luxtradingfirm.com\/privacy-policy\/\">https:\/\/luxtradingfirm.com\/privacy-policy\/<\/a><\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Article 5 Terms of use<\/strong><\/p>\r\n<p><strong>5.1 <\/strong>It is not permitted to use the Services for any purpose that violates UK, local, international, or any other applicable law or regulation. This includes the storage or transmission of data using services that are slanderous, libelous, or racist, or publishing information that is not based on truth.<\/p>\r\n<p><strong>5.2 <\/strong>If you fail to comply with the obligations set out in these Terms and Conditions, or otherwise act in a way that Lux Trading Firm considers to be inappropriate, Lux Trading Firm shall be entitled to give a written warning. Any failure to comply or other misconduct after the warning has been issued will either result in removal from the Services or termination of any collaboration between you and Lux Trading Firm. A warning will remain valid for as long as Lux Trading Firm considers it necessary.<\/p>\r\n<p><strong>5.3 <\/strong>If, in the opinion of Lux Trading Firm, the continued functioning of the computer systems or network of Lux Trading Firm, or third parties, is actually or under threat of being damaged or jeopardized, for example through the excessive transmission of e-mail or other data, leaks of personal data or virus activity, Lux Trading Firm may take all steps it deems reasonably necessary to end or avert such damage or jeopardy.<\/p>\r\n<p><strong>5.4 <\/strong>Lux Trading Firm is at all times entitled to file a criminal complaint for any offenses committed through or using the Services. In addition, Lux Trading Firm is entitled to supply your name, address, IP address, and other identifying data to a third party alleging that you violate its rights or these Terms and Conditions, provided the validity of the complaint is clear, no other way of obtaining this information exists and the third party has an evident interest in obtaining this information.<\/p>\r\n<p><strong>5.5 <\/strong>Lux Trading Firm may recoup from you all damages it suffers as a result of your violation of these terms of use. You agree to indemnify Lux Trading Firm against all third-party claims arising out of your violation of these terms of use.<\/p>\r\n<p><br \/><strong>Article 6 Availability and maintenance<\/strong><\/p>\r\n<p><strong>6.1 <\/strong>Lux Trading Firm makes no promises regarding the availability of any of the Services.<\/p>\r\n<p><strong>6.2<\/strong> Lux Trading Firm actively maintains its Services. Maintenance can take place at any time, even if this may negatively impact the availability of the Services. Maintenance is announced in advance whenever possible.<\/p>\r\n<p><strong>6.3 <\/strong>Lux Trading Firm may from time to time adapt the Services. Your feedback and suggestions are welcome, but ultimately Lux Trading Firm decides what adaptations to carry out (or not).<\/p>\r\n<p><strong>6.4 <\/strong>Lux Trading Firm is entitled to seize a Service without prior notification. If Lux Trading Firm terminates a Service, you agree that Lux Trading Firm is under no obligation to offer a refund or any other type of compensation.<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Article 7 Amendments<\/strong><\/p>\r\n<p><strong>7.1 <\/strong>Lux Trading Firm may amend these Terms and Conditions and any applicable prices or fees at any time. All changes or additions have an immediate effect, without notification being required.<\/p>\r\n<p><strong>7.2 <\/strong>If a client objects to any amendment, the parties will enter into consultation with each other. If the client chooses not to accept the changes or additions, it may terminate the Agreement. Termination will never result in any repayment obligation for Lux Trading Firm.<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Article 8 Refunds<\/strong><\/p>\r\n<p><strong>8.1 <\/strong>Once the client is sent his credentials, he is no longer entitled to any refund.  <\/p>\r\n<p><strong>8.2 <\/strong>The time and sole proof of the sending of credentials is based on Lux Trading Firm’s systems registration of sending these credentials.<\/p>\r\n<p><strong>8.3 <\/strong>The non-reception by the client, reception in spam folder, bouncing of email, and\/or delays in transmission caused by electronic systems does not invalidate point 8.1 and 8.2<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Article 9 Termination of Account<\/strong><\/p>\r\n<p><strong>9.1 <\/strong>Lux Trading Firm may, in its own sole judgment, terminate the account of a client, in the following circumstances<\/p>\r\n<p><strong>9.1.1 <\/strong>Breaking of the drawdown rule, defined in Trading Rules on the website.<\/p>\r\n<p><strong>9.1.2 <\/strong>Not following instructions regarding risk, trading volume, or size of stop loss<\/p>\r\n<p><strong>9.1.3 <\/strong>Breaking other rules, after being warned that the continued breaking of such rules constitutes a reason to terminate the client’s account.<\/p>\r\n<p><strong>9.1.4<\/strong> Gross negligence or Malicious Intent on the part of Client<\/p>\r\n<p><strong>9.2<\/strong> You are not allowed to trade multiple accounts, open at the same time. This includes accounts in your own name, and\/or other people&#8217;s names. This includes trading for friends, family, and\/or a group. In case you are found trading multiple accounts, all affected accounts will be terminated.<\/p>\r\n<p><strong>9.2.1<\/strong> The only exception to point 9.2 is when you are trading different asset classes, on each account, and after having obtained permission from Lux Trading to do so.<\/p>\r\n<p><strong>9.3 <\/strong>Group trading is not allowed and will result in the termination of all affected accounts. Group trading consists of multiple persons trading the same system or strategy, resulting in near-equal trades. <\/p>\r\n<p><strong>9.4<\/strong> The use of fully automatic EAs, robots, or automated systems in general, that are not the intellectual property of Client, is prohibited. The use of such EAs and\/or robots may result in the termination of your account.<\/p>\r\n<p><strong>9.5<\/strong> In the evaluation demo account, you are only allowed to trade a system or strategy, either traded manually or automated, which will also work on real money live accounts, and is accepted by our A-book broker and their liquidity providers. The use of such a system may result in the termination of your account.<\/p>\r\n<p><strong>9.6 <\/strong>The use of full automatic EAs, robots, or automated systems in general, that generate excessive trades, at either Lux&#8217;s or the broker&#8217;s discretion, is forbidden.<\/p>\r\n<p><strong>9.7<\/strong> Copy trading is only allowed when copying trades out, that is, when the account at Lux is the master account. Copying trades into a Lux account will result in the termination of that account.  <\/p>\r\n<p><strong>9.8 <\/strong>From stage 2 onward in career plans, you will be assigned a personal risk manager. Your risk manager is there to advise, support, and guide you in any way that is beneficial to both of us. Therefore, you are required to follow his advice diligently. In case of serious negligence, or poor risk management, your account might be closed at our discretion, and you will be expelled from the program.<\/p>\r\n<p><strong>9.9<\/strong> Termination will never result in any repayment obligation for Lux Trading Firm<\/p>\r\n<p><strong>9.10<\/strong> Client is not responsible for any losses on accounts, except in the case of Gross Negligence or Malicious Intent. In the case of Gross Negligence or Malicious Intent, the Client is responsible only for any losses due to this Gross Negligence.<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Article 10 Acceptance of trades and their results to pass evaluation or scaling.<\/strong><\/p>\r\n<p><strong>10.1 <\/strong>Lux Trading Firm may, in its own sole judgment, choose not to accept certain trades the client made, in Lux Trading Firm’s assessment of passing Evaluation or Scaling.<\/p>\r\n<p><strong>10.2 <\/strong>Among others<strong>, <\/strong>results of “Revenge Trades” or non-consistent trades may be excluded from accepted results.<\/p>\r\n<p><strong>10.3<\/strong> Trades performed by EAs, robots, or automated systems in general, may be excluded from accepted results<\/p>\r\n<p><strong>10.4<\/strong> Trades excluded from accepted results may affect net results, the number of active trading days, the passing of evaluation, and\/or eligibility for Scaling. <\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Article 11 Failing Evaluation and Retrying.<\/strong><\/p>\r\n<p><strong>11.1 <\/strong>When a client&#8217;s account is terminated because of any of the reasons enumerated in point 9, he or she fails the Evaluation<\/p>\r\n<p><strong>11.2 <\/strong>Retrying the Evaluation is possible by paying a reset fee.<\/p>\r\n<p><strong>11.3 <\/strong>Lux Trading Firm may, in its own sole judgment, choose not to accept the reset of a client’s account.<\/p>\r\n<p><strong>11.4 <\/strong>If Lux Trading Firms chooses not to accept a reset, the client is entitled to, and will get a full refund of the reset fee, within the shortest time possible.<\/p>\r\n<p><strong>11.5 <\/strong>If Lux Trading Firms chooses not to accept a reset, the client has no right to a refund of any other fees paid, or expenses made, by the client.<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Article 12 Calculation of results.<\/strong><\/p>\r\n<p><strong>12.1<\/strong> Calculations of results for passing evaluation (stages 1 and 2) is done daily.<\/p>\r\n<p><strong>12.2 <\/strong>Calculations of results for stage 3 and up are done the first weekend of a month for the previous month’s results.<\/p>\r\n<p><strong>12.3 <\/strong>Calculations of results for scaling are done the first weekend of a month for the previous month’s results. Scaling is only possible after the calculation of these results.<\/p>\r\n<p><strong>12.4<\/strong> For calculating results for stages 3 and up, any positive open equity will not be considered. All negative equity will be considered. Open equity carries over to next month’s results.<\/p>\r\n<p><strong>12.5 <\/strong>For stages 3 and up, realized losses in previous months will be considered, and must first be recuperated before a net positive result can be obtained. This is equivalent to working with a High-Water Mark system.<\/p>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Article 13.1 Lux Elite Traders Club<\/strong><\/p>\r\n<p><strong>13.1.1 <\/strong>The Lux Traders Elite Traders Club is a compound package that includes the services of a funded account, as described above, with several benefits, defined below.<\/p>\r\n<p><strong>13.1.2<\/strong> The differences between the standard funded account service and the ones included in the Elite package are as follows: at the end of stage 1, client will not receive his registration fee refunded. <\/p>\r\n<p><strong>13.2 Additional benefits of<\/strong> <strong>Lux Elite Traders Club. <\/strong>Having purchased a Lux elite traders club package gives clients the following extra benefits.<\/p>\r\n<p><strong>13.2.1 Test Account.<\/strong> A test account, for as long as the client has an active main account, with unlimited resets, for the same value as his initial main account.<\/p>\r\n<p><strong>13.2.2 Live Trading Room. <\/strong>Access to the live trading room, while the client has an active main account.<\/p>\r\n<p><strong>13.2.3 1-on-1 meetings.<\/strong> 1-on-1 meetings with mentors: Credits for 1-on-1 meetings with mentors. One credit is equivalent to one meeting of 45 minutes +a 15-minute courtesy for A. late-comers, B. to resolve any audio or video issues, C. to allow the mentor to send a follow-up by email. These 15 minutes can only be used for these purposes. Being late for more than 15 minutes is considered a disrespect to your mentor, and will result in the cancellation of the session and loss of the credit used. You are allowed to program one meeting per week with a mentor.<\/p>\r\n<p><strong>13.2.3.1<\/strong> Reservations and Cancellations: Reservations will only be accepted through the automated calendar system. Cancellations are allowed up to 24 hours before the time of the meeting. Later cancellations will result in the loss of the credit unless the mentor has more than 50% available time slots that day, in which case you will not lose the credit. <\/p>\r\n<p><strong>13.2.3.2<\/strong> Credits included in each package: 15K account packages: 10 credits. 10K account packages: 8 credits. 5K account packages: 6 credits <\/p>\r\n<p><strong>13.2.3.3<\/strong> Additional credits: Additional credits can be purchased at the price of GBP95.<\/p>\r\n<p><strong>13.2.4 Workshop.<\/strong> A visit to the Porto Montenegro trading room and workshop. There is 1 visit to the Porto Montenegro trading room and workshop included in each package. The workshop is available for elite traders with at least a 500K account.<\/p>\r\n<p><strong>13.2.4.1<\/strong> Visits have a duration of 3 nights for 1 person and will be held mid-week. Available dates will be published by Lux in advance and emailed to members of the Lux Elite Traders Club <\/p>\r\n<p><strong>13.2.4.2<\/strong> Expenses. Accommodations are paid for by Lux. Meals and travel (including possible Visa expenses) are at the expense of the client. Lux will assist within its means for travel arrangements and issues related to Visas (invitations, etc).<\/p>\r\n<p><strong>13.2.4.3<\/strong>. Additional workshops can be acquired at the prevailing prices. <\/p>\r\n<p><strong>13.2.5<\/strong> <strong>Educational videos. <\/strong>Access to all educational videos on demand.<\/p>\r\n<p><strong>13.2.6 Risk Desk. <\/strong>Access to the Lux Risk Desk by email, beginning at stage 1. Your risk manager is there to advise, support, and guide you in any way that is beneficial to both of us. Therefore, you are required to follow his advice diligently. In case of serious negligence, or poor risk management, your account might be closed at our discretion, and you will be expelled from the program.<\/p>\r\n<p><strong>Article 14 Dispute settlement<\/strong><\/p>\r\n<div class=\"rich-text-element-content absolute-fill element-content dir-ltr\">\r\n<div class=\"rich-text-positioning-wrapper vertical-alignment-top\">\r\n<div class=\"rich-text-content common-rich-content-style has-content\">\r\n<div data-line-height=\"1.4\">\r\n<div>\r\n<p><strong>14.1 <\/strong>The governing law and applicable jurisdiction in case of a dispute between Client and Lux Trading Firm is UK law, and only UK courts can decide on the outcome of such a dispute.<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n<br \/>​<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<div class=\"design-element element-size-box has-rich-content user-selectable-element clickable-element has-rich-content has-text is-section-child\" id=\"id1533558420111\" data-element-id=\"id1533558420111\">\r\n<div class=\"element-main-box design-element-main-box has-rich-content user-selectable-element clickable-element has-rich-content has-text\" data-element-id=\"id1533558420111\">\r\n<div class=\"element-background-layer element-border-target design-element-background-layer has-rich-content user-selectable-element clickable-element has-rich-content has-text\" data-element-id=\"id1533558420111\"><\/div>\r\n<div class=\"element-border-box element-border-target element-padding-box design-element-border-box has-rich-content user-selectable-element clickable-element has-rich-content has-text\" data-element-id=\"id1533558420111\">\r\n<div class=\"element-content-box design-element-content-box has-rich-content user-selectable-element clickable-element has-rich-content has-text\" data-element-id=\"id1533558420111\">\r\n<div class=\"content-container content-container-type element-size-box element-size-target has-rich-content user-selectable-element clickable-element has-rich-content has-text\" data-element-id=\"id1533558420111\">\r\n<div class=\"rich-text-element-content absolute-fill element-content dir-ltr\">\r\n<div class=\"rich-text-positioning-wrapper vertical-alignment-center\">\r\n<div class=\"rich-text-content common-rich-content-style has-content\"><\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n","protected":false},"excerpt":{"rendered":"<p>[vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; crypterium_vc_row_jarallax=&#8221;yes&#8221; el_id=&#8221;intro&#8221; p_img=&#8221;2015&#8243; crypterium_vc_row_jarallax_speed=&#8221;0.3&#8243;][vc_column][\/vc_column][\/vc_row][vc_row full_width=&#8221;stretch_row&#8221; crypterium_vc_row_overflow=&#8221;hidden&#8221; css=&#8221;.vc_custom_1608118807347{padding-top: 100px !important;padding-bottom: 50px !important;}&#8221;][vc_column][vc_row_inner][vc_column_inner][vc_column_text css=&#8221;.vc_custom_1608119619617{margin-bottom: 60px !important;}&#8221;] &nbsp; Lux Trading Firm is a trading name of Lux Trading Firm, a UK limited company. &nbsp; Introduction These are our General Terms and Conditions. These General Terms and Conditions apply to all our services and websites. Please read&#8230;<\/p>\n","protected":false},"author":198174106,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"vc_templates\/full-width-template.php","meta":{"_coblocks_attr":"","_coblocks_dimensions":"","_coblocks_responsive_height":"","_coblocks_accordion_ie_support":"","_mo_disable_npp":"","_starter_page_template":""},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v20.5 (Yoast SEO v20.5) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms &amp; Conditions - Lux Trading Firm<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/luxtradingfirm.com\/t_c\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms &amp; Conditions\" \/>\n<meta property=\"og:description\" content=\"&nbsp; Lux Trading Firm is a trading name of Lux Trading Firm, a UK limited company. &nbsp; Introduction These are our General Terms and Conditions. These\" \/>\n<meta property=\"og:url\" content=\"https:\/\/luxtradingfirm.com\/t_c\/\" \/>\n<meta property=\"og:site_name\" content=\"Lux Trading Firm\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/\" \/>\n<meta property=\"article:modified_time\" content=\"2022-12-26T11:41:49+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/Capture2-1-1024x733.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"733\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@FirmLux\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/luxtradingfirm.com\/t_c\/\",\"url\":\"https:\/\/luxtradingfirm.com\/t_c\/\",\"name\":\"Terms & Conditions - Lux Trading Firm\",\"isPartOf\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#website\"},\"datePublished\":\"2021-09-13T21:32:17+00:00\",\"dateModified\":\"2022-12-26T11:41:49+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/luxtradingfirm.com\/t_c\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/luxtradingfirm.com\/t_c\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/luxtradingfirm.com\/t_c\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/luxtradingfirm.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Terms &#038; Conditions\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/luxtradingfirm.com\/#website\",\"url\":\"https:\/\/luxtradingfirm.com\/\",\"name\":\"Lux Trading Firm\",\"description\":\"Funded Forex Trading Program\",\"publisher\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/luxtradingfirm.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/luxtradingfirm.com\/#organization\",\"name\":\"Lux Trading Firm\",\"url\":\"https:\/\/luxtradingfirm.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1\",\"contentUrl\":\"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1\",\"width\":3400,\"height\":1104,\"caption\":\"Lux Trading Firm\"},\"image\":{\"@id\":\"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/\",\"https:\/\/twitter.com\/FirmLux\",\"https:\/\/www.instagram.com\/luxtradingfirm\/\",\"https:\/\/www.youtube.com\/channel\/UCZydph7k_5BXAgHIedXPoKg\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Terms & Conditions - Lux Trading Firm","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/luxtradingfirm.com\/t_c\/","og_locale":"en_US","og_type":"article","og_title":"Terms & Conditions","og_description":"&nbsp; Lux Trading Firm is a trading name of Lux Trading Firm, a UK limited company. &nbsp; Introduction These are our General Terms and Conditions. These","og_url":"https:\/\/luxtradingfirm.com\/t_c\/","og_site_name":"Lux Trading Firm","article_publisher":"https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/","article_modified_time":"2022-12-26T11:41:49+00:00","og_image":[{"width":1024,"height":733,"url":"https:\/\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/Capture2-1-1024x733.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_site":"@FirmLux","twitter_misc":{"Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/luxtradingfirm.com\/t_c\/","url":"https:\/\/luxtradingfirm.com\/t_c\/","name":"Terms & Conditions - Lux Trading Firm","isPartOf":{"@id":"https:\/\/luxtradingfirm.com\/#website"},"datePublished":"2021-09-13T21:32:17+00:00","dateModified":"2022-12-26T11:41:49+00:00","breadcrumb":{"@id":"https:\/\/luxtradingfirm.com\/t_c\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/luxtradingfirm.com\/t_c\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/luxtradingfirm.com\/t_c\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/luxtradingfirm.com\/"},{"@type":"ListItem","position":2,"name":"Terms &#038; Conditions"}]},{"@type":"WebSite","@id":"https:\/\/luxtradingfirm.com\/#website","url":"https:\/\/luxtradingfirm.com\/","name":"Lux Trading Firm","description":"Funded Forex Trading Program","publisher":{"@id":"https:\/\/luxtradingfirm.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/luxtradingfirm.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/luxtradingfirm.com\/#organization","name":"Lux Trading Firm","url":"https:\/\/luxtradingfirm.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/","url":"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1","contentUrl":"https:\/\/i1.wp.com\/luxtradingfirm.com\/wp-content\/uploads\/2020\/12\/logo_transparent_background-6.png?fit=3400%2C1104&ssl=1","width":3400,"height":1104,"caption":"Lux Trading Firm"},"image":{"@id":"https:\/\/luxtradingfirm.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/Lux-Trading-Firm-105134371439044\/","https:\/\/twitter.com\/FirmLux","https:\/\/www.instagram.com\/luxtradingfirm\/","https:\/\/www.youtube.com\/channel\/UCZydph7k_5BXAgHIedXPoKg"]}]}},"jetpack_shortlink":"https:\/\/wp.me\/PcDwIy-2rA","amp_enabled":true,"_links":{"self":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages\/9398"}],"collection":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/users\/198174106"}],"replies":[{"embeddable":true,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/comments?post=9398"}],"version-history":[{"count":22,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages\/9398\/revisions"}],"predecessor-version":[{"id":23172,"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/pages\/9398\/revisions\/23172"}],"wp:attachment":[{"href":"https:\/\/luxtradingfirm.com\/wp-json\/wp\/v2\/media?parent=9398"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}